[{"illness": "Allergies", "url": "https://www.mayoclinic.org/diseases-conditions/allergies/symptoms-causes/syc-20351497", "symptoms": "Allergy symptoms, which depend on the substance involved, can affect your airways, sinuses and nasal passages, skin, and digestive system. Allergic reactions can range from mild to severe. In some severe cases, allergies can trigger a life-threatening reaction known as anaphylaxis. Hay fever, also called allergic rhinitis, can cause: Sneezing Itching of the nose, eyes or roof of the mouth Runny, stuffy nose Watery, red or swollen eyes (conjunctivitis) A food allergy can cause: Tingling in the mouth Swelling of the lips, tongue, face or throat Hives Anaphylaxis An insect sting allergy can cause: A large area of swelling (edema) at the sting site Itching or hives all over the body Cough, chest tightness, wheezing or shortness of breath Anaphylaxis A drug allergy can cause: Hives Itchy skin Rash Facial swelling Wheezing Anaphylaxis Atopic dermatitis, an allergic skin condition also called eczema, can cause skin to: Itch Redden Flake or peel Anaphylaxis Some types of allergies, including allergies to foods and insect stings, can trigger a severe reaction known as anaphylaxis. A life-threatening medical emergency, anaphylaxis can cause you to go into shock. Signs and symptoms of anaphylaxis include: Loss of consciousness A drop in blood pressure Severe shortness of breath Skin rash Lightheadedness A rapid, weak pulse Nausea and vomiting When to see a doctor You might see a doctor if you have symptoms you think are caused by an allergy, and over-the-counter allergy medications don't provide enough relief. If you have symptoms after starting a new medication, call the doctor who prescribed it right away. For a severe allergic reaction (anaphylaxis), call 911 or your local emergency number or seek emergency medical help. If you carry an epinephrine auto-injector (Auvi-Q, EpiPen, others), give yourself a shot right away. Even if your symptoms improve after an epinephrine injection, you should go to the emergency department to make sure symptoms don't return when the effects of the injection wear off. If you've had a severe allergy attack or any signs and symptoms of anaphylaxis in the past, make an appointment to see your doctor. Evaluation, diagnosis and long-term management of anaphylaxis are complicated, so you'll probably need to see a doctor who specializes in allergies and immunology. "}, {"illness": "Anaphylaxis", "url": "https://www.mayoclinic.org/diseases-conditions/anaphylaxis/symptoms-causes/syc-20351468", "symptoms": "Anaphylaxis symptoms usually occur within minutes of exposure to an allergen. Sometimes, however, anaphylaxis can occur a half-hour or longer after exposure. In rare cases, anaphylaxis may be delayed for hours. Signs and symptoms include: Skin reactions, including hives and itching and flushed or pale skin Low blood pressure (hypotension) Constriction of the airways and a swollen tongue or throat, which can cause wheezing and trouble breathing A weak and rapid pulse Nausea, vomiting or diarrhea Dizziness or fainting When to see a doctor Seek emergency medical help if you, your child or someone else you're with has a severe allergic reaction. Don't wait to see if the symptoms go away. If you have an attack and you carry an epinephrine autoinjector, administer it right away. Even if symptoms improve after the injection, you still need to go to an emergency room to make sure symptoms don't recur, even without more exposure to the allergen. This second reaction is called biphasic anaphylaxis. Make an appointment to see your provider if you or your child has had a severe allergy attack or signs and symptoms of anaphylaxis in the past. The diagnosis and long-term management of anaphylaxis are complicated, so you'll probably need to see a doctor who specializes in allergies and immunology. "}, {"illness": "Common cold", "url": "https://www.mayoclinic.org/diseases-conditions/common-cold/symptoms-causes/syc-20351605", "symptoms": "Symptoms of a common cold usually appear one to three days after exposure to a cold-causing virus. Signs and symptoms, which can vary from person to person, might include: Runny or stuffy nose Sore throat Cough Congestion Slight body aches or a mild headache Sneezing Low-grade fever Generally feeling unwell The discharge from your nose may start out clear and become thicker and yellow or green as a common cold runs its course. This doesn't usually mean you have a bacterial infection. When to see a doctor For adults — generally, you don't need medical attention for a common cold. However, seek medical attention if you have: Symptoms that worsen or fail to improve Fever greater than 101.3 F (38.5 C) lasting more than three days Fever returning after a fever-free period Shortness of breath Wheezing Severe sore throat, headache or sinus pain For children — in general, your child doesn't need to see his or her doctor for a common cold. But seek medical attention right away if your child has any of the following: Fever of 100.4 F (38 C) in newborns up to 12 weeks Rising fever or fever lasting more than two days in a child of any age Severe symptoms, such as headache, throat pain or cough Difficulty breathing or wheezing Ear pain Extreme fussiness Unusual drowsiness Lack of appetite "}, {"illness": "Influenza (flu)", "url": "https://www.mayoclinic.org/diseases-conditions/flu/symptoms-causes/syc-20351719", "symptoms": "At first, the flu may seem like a common cold with a runny nose, sneezing and sore throat. But colds usually develop slowly, whereas the flu tends to come on suddenly. And although a cold can be a bother, you usually feel much worse with the flu. Common signs and symptoms of the flu include: Fever Aching muscles Chills and sweats Headache Dry, persistent cough Shortness of breath Tiredness and weakness Runny or stuffy nose Sore throat Eye pain Vomiting and diarrhea, but this is more common in children than adults "}, {"illness": "Acute sinusitis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2019/01/22/14/53/healthy-sinus-8col-3330886-008-0.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/acute-sinusitis/symptoms-causes/syc-20351671", "symptoms": "Acute sinusitis signs and symptoms often include: Thick, yellow or greenish mucus from the nose (runny nose) or down the back of the throat (postnasal drainage) Blocked or stuffy nose (congestion) causing difficulty breathing through your nose Pain, tenderness, swelling and pressure around your eyes, cheeks, nose or forehead that worsens when bending over Other signs and symptoms include: Ear pressure Headache Aching in your teeth Altered sense of smell Cough Bad breath Fatigue Fever When to see a doctor Most people with acute sinusitis don't need to see a doctor. Contact your doctor if you have any of the following: Symptoms that last more than a week or so Symptoms that worsen after seeming to improve A persistent fever A history of recurrent or chronic sinusitis See a doctor immediately if you have signs or symptoms that may indicate a serious infection: Pain, swelling or redness around your eyes High fever Confusion Double vision or other vision changes Stiff neck "}, {"illness": "Alzheimer's disease", "url": "https://www.mayoclinic.org/diseases-conditions/alzheimers-disease/symptoms-causes/syc-20350447", "symptoms": "Memory loss is the key symptom of Alzheimer's disease. Early signs include difficulty remembering recent events or conversations. As the disease progresses, memory impairments worsen and other symptoms develop. At first, a person with Alzheimer's disease may be aware of having difficulty remembering things and organizing thoughts. A family member or friend may be more likely to notice how the symptoms worsen. Brain changes associated with Alzheimer's disease lead to growing trouble with: Memory Everyone has occasional memory lapses, but the memory loss associated with Alzheimer's disease persists and worsens, affecting the ability to function at work or at home. People with Alzheimer's may: Repeat statements and questions over and over Forget conversations, appointments or events, and not remember them later Routinely misplace possessions, often putting them in illogical locations Get lost in familiar places Eventually forget the names of family members and everyday objects Have trouble finding the right words to identify objects, express thoughts or take part in conversations Thinking and reasoning Alzheimer's disease causes difficulty concentrating and thinking, especially about abstract concepts such as numbers. Multitasking is especially difficult, and it may be challenging to manage finances, balance checkbooks and pay bills on time. Eventually, a person with Alzheimer's may be unable to recognize and deal with numbers. Making judgments and decisions Alzheimer's causes a decline in the ability to make reasonable decisions and judgments in everyday situations. For example, a person may make poor or uncharacteristic choices in social interactions or wear clothes that are inappropriate for the weather. It may be more difficult to respond effectively to everyday problems, such as food burning on the stove or unexpected driving situations. Planning and performing familiar tasks Once-routine activities that require sequential steps, such as planning and cooking a meal or playing a favorite game, become a struggle as the disease progresses. Eventually, people with advanced Alzheimer's often forget how to perform basic tasks such as dressing and bathing. Changes in personality and behavior Brain changes that occur in Alzheimer's disease can affect moods and behaviors. Problems may include the following: Depression Apathy Social withdrawal Mood swings Distrust in others Irritability and aggressiveness Changes in sleeping habits Wandering Loss of inhibitions Delusions, such as believing something has been stolen Preserved skills Many important skills are preserved for longer periods even while symptoms worsen. Preserved skills may include reading or listening to books, telling stories and reminiscing, singing, listening to music, dancing, drawing, or doing crafts. These skills may be preserved longer because they are controlled by parts of the brain affected later in the course of the disease. When to see a doctor A number of conditions, including treatable conditions, can result in memory loss or other dementia symptoms. If you are concerned about your memory or other thinking skills, talk to your doctor for a thorough assessment and diagnosis. If you are concerned about thinking skills you observe in a family member or friend, talk about your concerns and ask about going together to a doctor's appointment. "}, {"illness": "Dementia", "url": "https://www.mayoclinic.org/diseases-conditions/dementia/symptoms-causes/syc-20352013", "symptoms": "Dementia symptoms vary depending on the cause, but common signs and symptoms include: Cognitive changes Memory loss, which is usually noticed by someone else Difficulty communicating or finding words Difficulty with visual and spatial abilities, such as getting lost while driving Difficulty reasoning or problem-solving Difficulty handling complex tasks Difficulty with planning and organizing Difficulty with coordination and motor functions Confusion and disorientation Psychological changes Personality changes Depression Anxiety Inappropriate behavior Paranoia Agitation Hallucinations When to see a doctor See a doctor if you or a loved one has memory problems or other dementia symptoms. Some treatable medical conditions can cause dementia symptoms, so it's important to determine the cause. "}, {"illness": "Arthritis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/44/ds01122_ds00020_im03689_mcdc7_arthritis_typesthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/arthritis/symptoms-causes/syc-20350772", "symptoms": "The most common signs and symptoms of arthritis involve the joints. Depending on the type of arthritis, signs and symptoms may include: Pain Stiffness Swelling Redness Decreased range of motion "}, {"illness": "Gout", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2017/12/06/17/46/r7_gout-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/gout/symptoms-causes/syc-20372897", "symptoms": "Gout Gout Gout Gout causes intense pain and swelling around one or more joints. Gout most commonly affects the joint at the base of the big toe. The signs and symptoms of gout almost always occur suddenly, and often at night. They include: Intense joint pain. Gout usually affects the big toe, but it can occur in any joint. Other commonly affected joints include the ankles, knees, elbows, wrists and fingers. The pain is likely to be most severe within the first four to 12 hours after it begins. Lingering discomfort. After the most severe pain subsides, some joint discomfort may last from a few days to a few weeks. Later attacks are likely to last longer and affect more joints. Inflammation and redness. The affected joint or joints become swollen, tender, warm and red. Limited range of motion. As gout progresses, you may not be able to move your joints normally. When to see a doctor If you experience sudden, intense pain in a joint, call your doctor. Gout that goes untreated can lead to worsening pain and joint damage. Seek medical care immediately if you have a fever and a joint is hot and inflamed, which can be a sign of infection. "}, {"illness": "Lupus", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2017/10/23/16/01/lupus-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/lupus/symptoms-causes/syc-20365789", "symptoms": "Lupus facial rash Lupus facial rash Lupus facial rash A typical sign of lupus is a red, butterfly-shaped rash over your cheeks and nose, often following exposure to sunlight. No two cases of lupus are exactly alike. Signs and symptoms may come on suddenly or develop slowly, may be mild or severe, and may be temporary or permanent. Most people with lupus have mild disease characterized by episodes — called flares — when signs and symptoms get worse for a while, then improve or even disappear completely for a time. The signs and symptoms of lupus that you experience will depend on which body systems are affected by the disease. The most common signs and symptoms include: Fatigue Fever Joint pain, stiffness and swelling Butterfly-shaped rash on the face that covers the cheeks and bridge of the nose or rashes elsewhere on the body Skin lesions that appear or worsen with sun exposure Fingers and toes that turn white or blue when exposed to cold or during stressful periods Shortness of breath Chest pain Dry eyes Headaches, confusion and memory loss When to see a doctor See your doctor if you develop an unexplained rash, ongoing fever, persistent aching or fatigue. "}, {"illness": "Osteoarthritis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2016/04/11/15/47/ans7_osteoarthritis-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/osteoarthritis/symptoms-causes/syc-20351925", "symptoms": "Osteoarthritis of the spine Osteoarthritis of the spine Osteoarthritis of the spine In osteoarthritis of the spine, disks narrow and bone spurs form. Osteoarthritis of the hip Osteoarthritis of the hip Osteoarthritis of the hip The hip joint shown on the left side of the image is normal, but the hip joint shown on the right side of the image shows deterioration of cartilage and the formation of bone spurs due to osteoarthritis. Osteoarthritis symptoms often develop slowly and worsen over time. Signs and symptoms of osteoarthritis include: Pain. Affected joints might hurt during or after movement. Stiffness. Joint stiffness might be most noticeable upon awakening or after being inactive. Tenderness. Your joint might feel tender when you apply light pressure to or near it. Loss of flexibility. You might not be able to move your joint through its full range of motion. Grating sensation. You might feel a grating sensation when you use the joint, and you might hear popping or crackling. Bone spurs. These extra bits of bone, which feel like hard lumps, can form around the affected joint. Swelling. This might be caused by soft tissue inflammation around the joint. When to see a doctor If you have joint pain or stiffness that doesn't go away, make an appointment with your doctor. "}, {"illness": "Psoriatic arthritis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/18/ds00476_im01514_sn7_plaquepsoriasisthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/psoriatic-arthritis/symptoms-causes/syc-20354076", "symptoms": "Both psoriatic arthritis and psoriasis are chronic diseases that worsen over time. However, you might have periods when your symptoms improve or go away temporarily. Psoriatic arthritis can affect joints on one or both sides of your body. The signs and symptoms of psoriatic arthritis often resemble those of rheumatoid arthritis. Both diseases cause joints to become painful, swollen and warm to the touch. However, psoriatic arthritis is more likely to also cause: Swollen fingers and toes. Psoriatic arthritis can cause a painful, sausage-like swelling of your fingers and toes. Foot pain. Psoriatic arthritis can also cause pain at the points where tendons and ligaments attach to your bones — especially at the back of your heel (Achilles tendinitis) or in the sole of your foot (plantar fasciitis). Lower back pain. Some people develop a condition called spondylitis as a result of psoriatic arthritis. Spondylitis mainly causes inflammation of the joints between the vertebrae of your spine and in the joints between your spine and pelvis (sacroiliitis). Nail changes. Nails can form tiny dents (pits), crumble or separate from the nail beds. Eye inflammation. Uveitis can cause eye pain, redness and blurry vision. If untreated, uveitis can lead to vision loss. When to see a doctor If you have psoriasis, tell your doctor if you develop joint pain. Psoriatic arthritis can severely damage your joints if left untreated. "}, {"illness": "Rheumatoid arthritis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/47/ds00020_im02689_r7_rheumatoidarthritisthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/rheumatoid-arthritis/symptoms-causes/syc-20353648", "symptoms": "Signs and symptoms of rheumatoid arthritis may include: Tender, warm, swollen joints Joint stiffness that is usually worse in the mornings and after inactivity Fatigue, fever and loss of appetite Early rheumatoid arthritis tends to affect your smaller joints first — particularly the joints that attach your fingers to your hands and your toes to your feet. As the disease progresses, symptoms often spread to the wrists, knees, ankles, elbows, hips and shoulders. In most cases, symptoms occur in the same joints on both sides of your body. About 40% of people who have rheumatoid arthritis also experience signs and symptoms that don't involve the joints. Areas that may be affected include: Skin Eyes Lungs Heart Kidneys Salivary glands Nerve tissue Bone marrow Blood vessels Rheumatoid arthritis signs and symptoms may vary in severity and may even come and go. Periods of increased disease activity, called flares, alternate with periods of relative remission — when the swelling and pain fade or disappear. Over time, rheumatoid arthritis can cause joints to deform and shift out of place. When to see a doctor Make an appointment with your doctor if you have persistent discomfort and swelling in your joints. Rheumatoid Arthritis (function () {\n\t\t\t\t\t\tkWidget.embed({\"targetId\":\"kaltura-video-1_hvgfkq23\",\"wid\":\"_1825021\",\"uiconf_id\":44373111,\"flashvars\":{\"IframeCustomPluginCss1\":\"/-/media/kcms/ux/css/kaltura-player.css\",\"localizationCode\":\"auto\",\"autoPlay\":false},\"cache_st\":20200805,\"entry_id\":\"1_hvgfkq23\",\"readyCallback\": function(playerId) {var kdp = document.getElementById(playerId); kdp.addJsListener('doPlay', 'doPlayCallback'); window.inlineReadyCallbackCalled = playerId; }});\n\t\t\t\t\t})(); "}, {"illness": "Asthma", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/11/02/ds00021_ds00591_ds01040_im03162_ww5r370t_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/asthma/symptoms-causes/syc-20369653", "symptoms": "Asthma symptoms vary from person to person. You may have infrequent asthma attacks, have symptoms only at certain times — such as when exercising — or have symptoms all the time. Asthma signs and symptoms include: Shortness of breath Chest tightness or pain Wheezing when exhaling, which is a common sign of asthma in children Trouble sleeping caused by shortness of breath, coughing or wheezing Coughing or wheezing attacks that are worsened by a respiratory virus, such as a cold or the flu Signs that your asthma is probably worsening include: Asthma signs and symptoms that are more frequent and bothersome Increasing difficulty breathing, as measured with a device used to check how well your lungs are working (peak flow meter) The need to use a quick-relief inhaler more often For some people, asthma signs and symptoms flare up in certain situations: Exercise-induced asthma, which may be worse when the air is cold and dry Occupational asthma, triggered by workplace irritants such as chemical fumes, gases or dust Allergy-induced asthma, triggered by airborne substances, such as pollen, mold spores, cockroach waste, or particles of skin and dried saliva shed by pets (pet dander) When to see a doctor Seek emergency treatment Severe asthma attacks can be life-threatening. Work with your doctor to determine what to do when your signs and symptoms worsen — and when you need emergency treatment. Signs of an asthma emergency include: Rapid worsening of shortness of breath or wheezing No improvement even after using a quick-relief inhaler Shortness of breath when you are doing minimal physical activity Contact your doctor See your doctor: If you think you have asthma. If you have frequent coughing or wheezing that lasts more than a few days or any other signs or symptoms of asthma, see your doctor. Treating asthma early may prevent long-term lung damage and help keep the condition from getting worse over time. To monitor your asthma after diagnosis. If you know you have asthma, work with your doctor to keep it under control. Good long-term control helps you feel better from day to day and can prevent a life-threatening asthma attack. If your asthma symptoms get worse. Contact your doctor right away if your medication doesn't seem to ease your symptoms or if you need to use your quick-relief inhaler more often. Don't take more medication than prescribed without consulting your doctor first. Overusing asthma medication can cause side effects and may make your asthma worse. To review your treatment. Asthma often changes over time. Meet with your doctor regularly to discuss your symptoms and make any needed treatment adjustments. "}, {"illness": "Cancer", "url": "https://www.mayoclinic.org/diseases-conditions/cancer/symptoms-causes/syc-20370588", "symptoms": "Signs and symptoms caused by cancer will vary depending on what part of the body is affected. Some general signs and symptoms associated with, but not specific to, cancer, include: Fatigue Lump or area of thickening that can be felt under the skin Weight changes, including unintended loss or gain Skin changes, such as yellowing, darkening or redness of the skin, sores that won't heal, or changes to existing moles Changes in bowel or bladder habits Persistent cough or trouble breathing Difficulty swallowing Hoarseness Persistent indigestion or discomfort after eating Persistent, unexplained muscle or joint pain Persistent, unexplained fevers or night sweats Unexplained bleeding or bruising When to see a doctor Make an appointment with your doctor if you have any persistent signs or symptoms that concern you. If you don't have any signs or symptoms, but are worried about your risk of cancer, discuss your concerns with your doctor. Ask about which cancer screening tests and procedures are appropriate for you. "}, {"illness": "Breast cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/39/ds00328_-ds00982_-ds000983_-ds01063_-ds01070_-hq00348_im01880_r7_breastthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/breast-cancer/symptoms-causes/syc-20352470", "symptoms": "Nipple changes Nipple changes Nipple changes Breast and nipple changes can be a sign of breast cancer. Make an appointment with your doctor if you notice anything unusual. Signs and symptoms of breast cancer may include: A breast lump or thickening that feels different from the surrounding tissue Change in the size, shape or appearance of a breast Changes to the skin over the breast, such as dimpling A newly inverted nipple Peeling, scaling, crusting or flaking of the pigmented area of skin surrounding the nipple (areola) or breast skin Redness or pitting of the skin over your breast, like the skin of an orange When to see a doctor If you find a lump or other change in your breast — even if a recent mammogram was normal — make an appointment with your doctor for prompt evaluation. "}, {"illness": "Cervical cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/45/ds00167_im04600_mcdc7_cervicalcancerthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/cervical-cancer/symptoms-causes/syc-20352501", "symptoms": "Female reproductive system Female reproductive system Female reproductive system The ovaries, fallopian tubes, uterus, cervix and vagina (vaginal canal) make up the female reproductive system. Early-stage cervical cancer generally produces no signs or symptoms. Signs and symptoms of more-advanced cervical cancer include: Vaginal bleeding after intercourse, between periods or after menopause Watery, bloody vaginal discharge that may be heavy and have a foul odor Pelvic pain or pain during intercourse When to see a doctor Make an appointment with your doctor if you have any signs or symptoms that concern you. "}, {"illness": "Colon cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/23/ds00035_im01666_colon_gif.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/colon-cancer/symptoms-causes/syc-20353669", "symptoms": "Signs and symptoms of colon cancer include: A persistent change in your bowel habits, including diarrhea or constipation or a change in the consistency of your stool Rectal bleeding or blood in your stool Persistent abdominal discomfort, such as cramps, gas or pain A feeling that your bowel doesn't empty completely Weakness or fatigue Unexplained weight loss Many people with colon cancer experience no symptoms in the early stages of the disease. When symptoms appear, they'll likely vary, depending on the cancer's size and location in your large intestine. When to see a doctor If you notice any persistent symptoms that worry you, make an appointment with your doctor. Talk with your doctor about when to begin colon cancer screening. Guidelines generally recommend that colon cancer screenings begin around 50. Your doctor may recommend more frequent or earlier screening if you have other risk factors, such as a family history of the disease. "}, {"illness": "Liver cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/37/ds00097_-ds00398_-ds00399_-ds00411_im04073_mcdc7_livercancerthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/liver-cancer/symptoms-causes/syc-20353659", "symptoms": "The liver The liver The liver The liver is your largest internal organ. About the size of a football, it's located mainly in the upper right portion of your abdomen, beneath the diaphragm and above your stomach. Most people don't have signs and symptoms in the early stages of primary liver cancer. When signs and symptoms do appear, they may include: Losing weight without trying Loss of appetite Upper abdominal pain Nausea and vomiting General weakness and fatigue Abdominal swelling Yellow discoloration of your skin and the whites of your eyes (jaundice) White, chalky stools When to see a doctor Make an appointment with your doctor if you experience any signs or symptoms that worry you. "}, {"illness": "Lung cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2017/12/29/22/46/lung-cancer-tumor-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/lung-cancer/symptoms-causes/syc-20374620", "symptoms": "Lung cancer typically doesn't cause signs and symptoms in its earliest stages. Signs and symptoms of lung cancer typically occur when the disease is advanced. Signs and symptoms of lung cancer may include: A new cough that doesn't go away Coughing up blood, even a small amount Shortness of breath Chest pain Hoarseness Losing weight without trying Bone pain Headache When to see a doctor Make an appointment with your doctor if you have any persistent signs or symptoms that worry you. If you smoke and have been unable to quit, make an appointment with your doctor. Your doctor can recommend strategies for quitting smoking, such as counseling, medications and nicotine replacement products. "}, {"illness": "Pancreatic cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/09/59/ds00371_im00504_d7_digestionsystemthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/pancreatic-cancer/symptoms-causes/syc-20355421", "symptoms": "Signs and symptoms of pancreatic cancer often don't occur until the disease is advanced. They may include: Abdominal pain that radiates to your back Loss of appetite or unintended weight loss Yellowing of your skin and the whites of your eyes (jaundice) Light-colored stools Dark-colored urine Itchy skin New diagnosis of diabetes or existing diabetes that's becoming more difficult to control Blood clots Fatigue When to see a doctor See your doctor if you experience any unexplained symptoms that worry you. Many other conditions can cause these symptoms, so your doctor may check for these conditions as well as for pancreatic cancer. "}, {"illness": "Prostate cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/38/ds00043_-my01633_im01561_prostca1thu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/prostate-cancer/symptoms-causes/syc-20353087", "symptoms": "Prostate cancer may cause no signs or symptoms in its early stages. Prostate cancer that's more advanced may cause signs and symptoms such as: Trouble urinating Decreased force in the stream of urine Blood in the urine Blood in the semen Bone pain Losing weight without trying Erectile dysfunction When to see a doctor Make an appointment with your doctor if you have any persistent signs or symptoms that worry you. "}, {"illness": "Skin cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/42/ds00190_-ds00925_im00272_basal_gif.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/skin-cancer/symptoms-causes/syc-20377605", "symptoms": "Where skin cancer develops Basal cell carcinoma on white skin Basal cell carcinoma on white skin Basal cell carcinoma on white skin Basal cell carcinoma is a type of skin cancer that most often develops on areas of skin exposed to the sun, such as the face. On white skin, basal cell carcinoma often looks like a bump that's skin-colored or pink. Squamous cell carcinoma of the skin Squamous cell carcinoma of the skin Squamous cell carcinoma of the skin Sun-exposed areas such as the lips and ears are especially likely to develop squamous cell carcinoma of the skin. Melanoma Melanoma Melanoma The first sign of melanoma is often a mole that changes size, shape or color. This melanoma shows color variations and an irregular border, both of which are melanoma warning signs. Merkel cell carcinoma Merkel cell carcinoma Merkel cell carcinoma Merkel cell carcinoma is a rare, aggressive skin cancer. It appears as a painless, flesh-colored or bluish-red nodule growing on your skin. Skin cancer develops primarily on areas of sun-exposed skin, including the scalp, face, lips, ears, neck, chest, arms and hands, and on the legs in women. But it can also form on areas that rarely see the light of day — your palms, beneath your fingernails or toenails, and your genital area. Skin cancer affects people of all skin tones, including those with darker complexions. When melanoma occurs in people with dark skin tones, it's more likely to occur in areas not normally exposed to the sun, such as the palms of the hands and soles of the feet. Basal cell carcinoma signs and symptoms Basal cell carcinoma usually occurs in sun-exposed areas of your body, such as your neck or face. Basal cell carcinoma may appear as: A pearly or waxy bump A flat, flesh-colored or brown scar-like lesion A bleeding or scabbing sore that heals and returns Squamous cell carcinoma signs and symptoms Most often, squamous cell carcinoma occurs on sun-exposed areas of your body, such as your face, ears and hands. People with darker skin are more likely to develop squamous cell carcinoma on areas that aren't often exposed to the sun. Squamous cell carcinoma may appear as: A firm, red nodule A flat lesion with a scaly, crusted surface Melanoma signs and symptoms Melanoma can develop anywhere on your body, in otherwise normal skin or in an existing mole that becomes cancerous. Melanoma most often appears on the face or the trunk of affected men. In women, this type of cancer most often develops on the lower legs. In both men and women, melanoma can occur on skin that hasn't been exposed to the sun. Melanoma can affect people of any skin tone. In people with darker skin tones, melanoma tends to occur on the palms or soles, or under the fingernails or toenails. Melanoma signs include: A large brownish spot with darker speckles A mole that changes in color, size or feel or that bleeds A small lesion with an irregular border and portions that appear red, pink, white, blue or blue-black A painful lesion that itches or burns Dark lesions on your palms, soles, fingertips or toes, or on mucous membranes lining your mouth, nose, vagina or anus Signs and symptoms of less common skin cancers Other, less common types of skin cancer include: Kaposi sarcoma. This rare form of skin cancer develops in the skin's blood vessels and causes red or purple patches on the skin or mucous membranes. Kaposi sarcoma mainly occurs in people with weakened immune systems, such as people with AIDS, and in people taking medications that suppress their natural immunity, such as people who've undergone organ transplants. Other people with an increased risk of Kaposi sarcoma include young men living in Africa or older men of Italian or Eastern European Jewish heritage. Merkel cell carcinoma. Merkel cell carcinoma causes firm, shiny nodules that occur on or just beneath the skin and in hair follicles. Merkel cell carcinoma is most often found on the head, neck and trunk. Sebaceous gland carcinoma. This uncommon and aggressive cancer originates in the oil glands in the skin. Sebaceous gland carcinomas — which usually appear as hard, painless nodules — can develop anywhere, but most occur on the eyelid, where they're frequently mistaken for other eyelid problems. When to see a doctor Make an appointment with your doctor if you notice any changes to your skin that worry you. Not all skin changes are caused by skin cancer. Your doctor will investigate your skin changes to determine a cause. "}, {"illness": "Testicular cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/42/r7_malereprothu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/testicular-cancer-care/symptoms-causes/syc-20352986", "symptoms": "Testicular lumps Testicular lumps Testicular lumps Pain, swelling or lumps in your testicle or groin area may be a sign or symptom of testicular cancer or other medical conditions requiring treatment. Signs and symptoms of testicular cancer include: A lump or enlargement in either testicle A feeling of heaviness in the scrotum A dull ache in the abdomen or groin A sudden collection of fluid in the scrotum Pain or discomfort in a testicle or the scrotum Enlargement or tenderness of the breasts Back pain Cancer usually affects only one testicle. When to see a doctor See your doctor if you detect any pain, swelling or lumps in your testicles or groin area, especially if these signs and symptoms last longer than two weeks. "}, {"illness": "Heart attack", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/08/ds00094_im00938_mcdc7_heartattackthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/heart-attack/symptoms-causes/syc-20373106", "symptoms": "Common heart attack signs and symptoms include: Pressure, tightness, pain, or a squeezing or aching sensation in your chest or arms that may spread to your neck, jaw or back Nausea, indigestion, heartburn or abdominal pain Shortness of breath Cold sweat Fatigue Lightheadedness or sudden dizziness Heart attack symptoms vary Not all people who have heart attacks have the same symptoms or have the same severity of symptoms. Some people have mild pain; others have more severe pain. Some people have no symptoms. For others, the first sign may be sudden cardiac arrest. However, the more signs and symptoms you have, the greater the chance you're having a heart attack. Some heart attacks strike suddenly, but many people have warning signs and symptoms hours, days or weeks in advance. The earliest warning might be recurrent chest pain or pressure (angina) that's triggered by activity and relieved by rest. Angina is caused by a temporary decrease in blood flow to the heart. When to see a doctor Act immediately. Some people wait too long because they don't recognize the important signs and symptoms. Take these steps: Call for emergency medical help. If you suspect you're having a heart attack, don't hesitate. Immediately call 911 or your local emergency number. If you don't have access to emergency medical services, have someone drive you to the nearest hospital. Drive yourself only if there are no other options. Because your condition can worsen, driving yourself puts you and others at risk. Take nitroglycerin, if prescribed to you by a doctor. Take it as instructed while awaiting emergency help. Take aspirin, if recommended. Taking aspirin during a heart attack could reduce heart damage by helping to keep your blood from clotting. Aspirin can interact with other medications, however, so don't take an aspirin unless your doctor or emergency medical personnel recommend it. Don't delay calling 911 to take an aspirin. Call for emergency help first. What to do if you see someone who might be having a heart attack If you see someone who's unconscious and you believe is having a heart attack, first call for emergency medical help. Then check if the person is breathing and has a pulse. If the person isn't breathing or you don't find a pulse, only then should you begin CPR. Push hard and fast on the person's chest in a fairly rapid rhythm — about 100 to 120 compressions a minute. If you haven't been trained in CPR, doctors recommend performing only chest compressions. If you have been trained in CPR, you can go on to opening the airway and rescue breathing. "}, {"illness": "Herniated disk", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2016/11/22/17/38/mcdc7_herniated_disk-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/herniated-disk/symptoms-causes/syc-20354095", "symptoms": "Most herniated disks occur in the lower back, but they can also occur in the neck. Signs and symptoms depend on where the disk is situated and whether the disk is pressing on a nerve. Herniated disks usually affect one side of the body. Arm or leg pain. If your herniated disk is in your lower back, besides pain in your lower back, you'll typically feel pain in your buttocks, thigh and calf. You might have pain in part of the foot as well. For a herniated disk in your neck, you'll typically feel the most pain in your shoulder and arm. This pain might shoot into your arm or leg when you cough, sneeze or move into certain positions. Pain is often described as sharp or burning. Numbness or tingling. People who have a herniated disk often have radiating numbness or tingling in the body part served by the affected nerves. Weakness. Muscles served by the affected nerves tend to weaken. This can cause you to stumble, or affect your ability to lift or hold items. You can have a herniated disk without symptoms. You might not know you have it unless it shows up on a spinal image. When to see a doctor Seek medical attention if your neck or back pain travels down your arm or leg, or if you also have numbness, tingling or weakness. "}, {"illness": "Pneumonia", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2016/05/18/13/02/ww5r032t-8col-jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/pneumonia/symptoms-causes/syc-20354204", "symptoms": "The signs and symptoms of pneumonia vary from mild to severe, depending on factors such as the type of germ causing the infection, and your age and overall health. Mild signs and symptoms often are similar to those of a cold or flu, but they last longer. Signs and symptoms of pneumonia may include: Chest pain when you breathe or cough Confusion or changes in mental awareness (in adults age 65 and older) Cough, which may produce phlegm Fatigue Fever, sweating and shaking chills Lower than normal body temperature (in adults older than age 65 and people with weak immune systems) Nausea, vomiting or diarrhea Shortness of breath Newborns and infants may not show any sign of the infection. Or they may vomit, have a fever and cough, appear restless or tired and without energy, or have difficulty breathing and eating. When to see a doctor See your doctor if you have difficulty breathing, chest pain, persistent fever of 102 F (39 C) or higher, or persistent cough, especially if you're coughing up pus. It's especially important that people in these high-risk groups see a doctor: Adults older than age 65 Children younger than age 2 with signs and symptoms People with an underlying health condition or weakened immune system People receiving chemotherapy or taking medication that suppresses the immune system For some older adults and people with heart failure or chronic lung problems, pneumonia can quickly become a life-threatening condition. "}, {"illness": "Strep throat", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/37/ds00260_id7_strepthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/strep-throat/symptoms-causes/syc-20350338", "symptoms": "Strep throat infection Strep throat infection Strep throat infection Strep throat usually causes throat pain and difficulty swallowing. This photo of strep throat shows inflammation and red spots, caused by the infection. Signs and symptoms of strep throat can include: Throat pain that usually comes on quickly Painful swallowing Red and swollen tonsils, sometimes with white patches or streaks of pus Tiny red spots on the area at the back of the roof of the mouth (soft or hard palate) Swollen, tender lymph nodes in your neck Fever Headache Rash Nausea or vomiting, especially in younger children Body aches It's possible for you or your child to have many of these signs and symptoms but not have strep throat. The cause of these signs and symptoms could be a viral infection or some other illness. That's why your doctor generally tests specifically for strep throat. It's also possible for you to be exposed to a person who carries strep but shows no symptoms. When to see a doctor Call your doctor if you or your child has any of these signs and symptoms: A sore throat accompanied by tender, swollen lymph glands A sore throat that lasts longer than 48 hours A fever A sore throat accompanied by a rash Problems breathing or swallowing If strep has been diagnosed, a lack of improvement after taking antibiotics for 48 hours "}, {"illness": "H1N1 flu (swine flu)", "url": "https://www.mayoclinic.org/diseases-conditions/swine-flu/symptoms-causes/syc-20378103", "symptoms": "The signs and symptoms of flu caused by the H1N1 virus are similar to those of infections caused by other flu strains and can include: Fever, but not always Chills Cough Sore throat Runny or stuffy nose Watery, red eyes Body aches Headache Fatigue Diarrhea Nausea and vomiting Flu symptoms develop about one to three days after you're exposed to the virus. When to see a doctor It's not necessary to see a doctor if you're generally healthy and develop flu signs and symptoms, such as fever, cough and body aches. Call your doctor, however, if you have flu symptoms and you're pregnant or you have a chronic disease, such as asthma, emphysema, diabetes or a heart condition, because you have a higher risk of flu complications. If you have emergency signs and symptoms of the flu, get medical care right away. For adults, emergency signs and symptoms can include: Difficulty breathing or shortness of breath Chest pain Ongoing dizziness Seizures Worsening of existing medical conditions Severe weakness or muscle pain Emergency signs and symptoms in children can include: Difficulty breathing Blue lips Chest pain Dehydration Severe muscle pain Seizures Worsening of existing medical conditions "}, {"illness": "Tonsillitis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/39/my00132_-ds00273_-my02352_im00197_r7_tonsillitis2_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/tonsillitis/symptoms-causes/syc-20378479", "symptoms": "Tonsillitis most commonly affects children between preschool ages and the midteenage years. Common signs and symptoms of tonsillitis include: Red, swollen tonsils White or yellow coating or patches on the tonsils Sore throat Difficult or painful swallowing Fever Enlarged, tender glands (lymph nodes) in the neck A scratchy, muffled or throaty voice Bad breath Stomachache Neck pain or stiff neck Headache In young children who are unable to describe how they feel, signs of tonsillitis may include: Drooling due to difficult or painful swallowing Refusal to eat Unusual fussiness When to see a doctor It's important to get an accurate diagnosis if your child has symptoms that may indicate tonsillitis. Call your doctor if your child is experiencing: A sore throat with fever A sore throat that doesn't go away within 24 to 48 hours Painful or difficult swallowing Extreme weakness, fatigue or fussiness Get immediate care if your child has any of these signs: Difficulty breathing Extreme difficulty swallowing Excessive drooling "}, {"illness": "Bipolar disorder", "url": "https://www.mayoclinic.org/diseases-conditions/bipolar-disorder/symptoms-causes/syc-20355955", "symptoms": "There are several types of bipolar and related disorders. They may include mania or hypomania and depression. Symptoms can cause unpredictable changes in mood and behavior, resulting in significant distress and difficulty in life. Bipolar I disorder. You've had at least one manic episode that may be preceded or followed by hypomanic or major depressive episodes. In some cases, mania may trigger a break from reality (psychosis). Bipolar II disorder. You've had at least one major depressive episode and at least one hypomanic episode, but you've never had a manic episode. Cyclothymic disorder. You've had at least two years — or one year in children and teenagers — of many periods of hypomania symptoms and periods of depressive symptoms (though less severe than major depression). Other types. These include, for example, bipolar and related disorders induced by certain drugs or alcohol or due to a medical condition, such as Cushing's disease, multiple sclerosis or stroke. Bipolar II disorder is not a milder form of bipolar I disorder, but a separate diagnosis. While the manic episodes of bipolar I disorder can be severe and dangerous, individuals with bipolar II disorder can be depressed for longer periods, which can cause significant impairment. Although bipolar disorder can occur at any age, typically it's diagnosed in the teenage years or early 20s. Symptoms can vary from person to person, and symptoms may vary over time. Mania and hypomania Mania and hypomania are two distinct types of episodes, but they have the same symptoms. Mania is more severe than hypomania and causes more noticeable problems at work, school and social activities, as well as relationship difficulties. Mania may also trigger a break from reality (psychosis) and require hospitalization. Both a manic and a hypomanic episode include three or more of these symptoms: Abnormally upbeat, jumpy or wired Increased activity, energy or agitation Exaggerated sense of well-being and self-confidence (euphoria) Decreased need for sleep Unusual talkativeness Racing thoughts Distractibility Poor decision-making — for example, going on buying sprees, taking sexual risks or making foolish investments Major depressive episode A major depressive episode includes symptoms that are severe enough to cause noticeable difficulty in day-to-day activities, such as work, school, social activities or relationships. An episode includes five or more of these symptoms: Depressed mood, such as feeling sad, empty, hopeless or tearful (in children and teens, depressed mood can appear as irritability) Marked loss of interest or feeling no pleasure in all — or almost all — activities Significant weight loss when not dieting, weight gain, or decrease or increase in appetite (in children, failure to gain weight as expected can be a sign of depression) Either insomnia or sleeping too much Either restlessness or slowed behavior Fatigue or loss of energy Feelings of worthlessness or excessive or inappropriate guilt Decreased ability to think or concentrate, or indecisiveness Thinking about, planning or attempting suicide Other features of bipolar disorder Signs and symptoms of bipolar I and bipolar II disorders may include other features, such as anxious distress, melancholy, psychosis or others. The timing of symptoms may include diagnostic labels such as mixed or rapid cycling. In addition, bipolar symptoms may occur during pregnancy or change with the seasons. Symptoms in children and teens Symptoms of bipolar disorder can be difficult to identify in children and teens. It's often hard to tell whether these are normal ups and downs, the results of stress or trauma, or signs of a mental health problem other than bipolar disorder. Children and teens may have distinct major depressive or manic or hypomanic episodes, but the pattern can vary from that of adults with bipolar disorder. And moods can rapidly shift during episodes. Some children may have periods without mood symptoms between episodes. The most prominent signs of bipolar disorder in children and teenagers may include severe mood swings that are different from their usual mood swings. When to see a doctor Despite the mood extremes, people with bipolar disorder often don't recognize how much their emotional instability disrupts their lives and the lives of their loved ones and don't get the treatment they need. And if you're like some people with bipolar disorder, you may enjoy the feelings of euphoria and cycles of being more productive. However, this euphoria is always followed by an emotional crash that can leave you depressed, worn out — and perhaps in financial, legal or relationship trouble. If you have any symptoms of depression or mania, see your doctor or mental health professional. Bipolar disorder doesn't get better on its own. Getting treatment from a mental health professional with experience in bipolar disorder can help you get your symptoms under control. When to get emergency help Suicidal thoughts and behavior are common among people with bipolar disorder. If you have thoughts of hurting yourself, call 911 or your local emergency number immediately, go to an emergency room, or confide in a trusted relative or friend. Or call a suicide hotline number — in the United States, call the National Suicide Prevention Lifeline at 1-800-273-TALK (1-800-273-8255). If you have a loved one who is in danger of suicide or has made a suicide attempt, make sure someone stays with that person. Call 911 or your local emergency number immediately. Or, if you think you can do so safely, take the person to the nearest hospital emergency room. "}, {"illness": "Depression (major depressive disorder)", "url": "https://www.mayoclinic.org/diseases-conditions/depression/symptoms-causes/syc-20356007", "symptoms": "Although depression may occur only once during your life, people typically have multiple episodes. During these episodes, symptoms occur most of the day, nearly every day and may include: Feelings of sadness, tearfulness, emptiness or hopelessness Angry outbursts, irritability or frustration, even over small matters Loss of interest or pleasure in most or all normal activities, such as sex, hobbies or sports Sleep disturbances, including insomnia or sleeping too much Tiredness and lack of energy, so even small tasks take extra effort Reduced appetite and weight loss or increased cravings for food and weight gain Anxiety, agitation or restlessness Slowed thinking, speaking or body movements Feelings of worthlessness or guilt, fixating on past failures or self-blame Trouble thinking, concentrating, making decisions and remembering things Frequent or recurrent thoughts of death, suicidal thoughts, suicide attempts or suicide Unexplained physical problems, such as back pain or headaches For many people with depression, symptoms usually are severe enough to cause noticeable problems in day-to-day activities, such as work, school, social activities or relationships with others. Some people may feel generally miserable or unhappy without really knowing why. Depression symptoms in children and teens Common signs and symptoms of depression in children and teenagers are similar to those of adults, but there can be some differences. In younger children, symptoms of depression may include sadness, irritability, clinginess, worry, aches and pains, refusing to go to school, or being underweight. In teens, symptoms may include sadness, irritability, feeling negative and worthless, anger, poor performance or poor attendance at school, feeling misunderstood and extremely sensitive, using recreational drugs or alcohol, eating or sleeping too much, self-harm, loss of interest in normal activities, and avoidance of social interaction. Depression symptoms in older adults Depression is not a normal part of growing older, and it should never be taken lightly. Unfortunately, depression often goes undiagnosed and untreated in older adults, and they may feel reluctant to seek help. Symptoms of depression may be different or less obvious in older adults, such as: Memory difficulties or personality changes Physical aches or pain Fatigue, loss of appetite, sleep problems or loss of interest in sex — not caused by a medical condition or medication Often wanting to stay at home, rather than going out to socialize or doing new things Suicidal thinking or feelings, especially in older men When to see a doctor If you feel depressed, make an appointment to see your doctor or mental health professional as soon as you can. If you're reluctant to seek treatment, talk to a friend or loved one, any health care professional, a faith leader, or someone else you trust. When to get emergency help If you think you may hurt yourself or attempt suicide, call 911 or your local emergency number immediately. Also consider these options if you're having suicidal thoughts: Call your doctor or mental health professional. Call a suicide hotline number — in the U.S., call the National Suicide Prevention Lifeline at 1-800-273-TALK (1-800-273-8255). Use that same number and press \"1\" to reach the Veterans Crisis Line. Reach out to a close friend or loved one. Contact a minister, spiritual leader or someone else in your faith community. If you have a loved one who is in danger of suicide or has made a suicide attempt, make sure someone stays with that person. Call 911 or your local emergency number immediately. Or, if you think you can do so safely, take the person to the nearest hospital emergency room. "}, {"illness": "Persistent depressive disorder (dysthymia)", "url": "https://www.mayoclinic.org/diseases-conditions/persistent-depressive-disorder/symptoms-causes/syc-20350929", "symptoms": "Persistent depressive disorder symptoms usually come and go over a period of years, and their intensity can change over time. But typically symptoms don't disappear for more than two months at a time. In addition, major depression episodes may occur before or during persistent depressive disorder — this is sometimes called double depression. Symptoms of persistent depressive disorder can cause significant impairment and may include: Loss of interest in daily activities Sadness, emptiness or feeling down Hopelessness Tiredness and lack of energy Low self-esteem, self-criticism or feeling incapable Trouble concentrating and trouble making decisions Irritability or excessive anger Decreased activity, effectiveness and productivity Avoidance of social activities Feelings of guilt and worries over the past Poor appetite or overeating Sleep problems In children, symptoms of persistent depressive disorder may include depressed mood and irritability. When to see a doctor Because these feelings have gone on for such a long time, you may think they'll always be part of your life. But if you have any symptoms of persistent depressive disorder, seek medical help. Talk to your primary care doctor about your symptoms. Or seek help directly from a mental health professional. If you're reluctant to see a mental health professional, reach out to someone else who may be able to help guide you to treatment, whether it's a friend or loved one, a teacher, a faith leader, or someone else you trust. If you think you may hurt yourself or attempt suicide, call 911 or your local emergency number immediately. "}, {"illness": "Panic attacks and panic disorder", "url": "https://www.mayoclinic.org/diseases-conditions/panic-attacks/symptoms-causes/syc-20376021", "symptoms": "Panic attacks typically begin suddenly, without warning. They can strike at any time — when you're driving a car, at the mall, sound asleep or in the middle of a business meeting. You may have occasional panic attacks, or they may occur frequently. Panic attacks have many variations, but symptoms usually peak within minutes. You may feel fatigued and worn out after a panic attack subsides. Panic attacks typically include some of these signs or symptoms: Sense of impending doom or danger Fear of loss of control or death Rapid, pounding heart rate Sweating Trembling or shaking Shortness of breath or tightness in your throat Chills Hot flashes Nausea Abdominal cramping Chest pain Headache Dizziness, lightheadedness or faintness Numbness or tingling sensation Feeling of unreality or detachment One of the worst things about panic attacks is the intense fear that you'll have another one. You may fear having panic attacks so much that you avoid certain situations where they may occur. When to see a doctor If you have panic attack symptoms, seek medical help as soon as possible. Panic attacks, while intensely uncomfortable, are not dangerous. But panic attacks are hard to manage on your own, and they may get worse without treatment. Panic attack symptoms can also resemble symptoms of other serious health problems, such as a heart attack, so it's important to get evaluated by your primary care provider if you aren't sure what's causing your symptoms. "}, {"illness": "Post-traumatic stress disorder (PTSD)", "url": "https://www.mayoclinic.org/diseases-conditions/post-traumatic-stress-disorder/symptoms-causes/syc-20355967", "symptoms": "Post-traumatic stress disorder symptoms may start within one month of a traumatic event, but sometimes symptoms may not appear until years after the event. These symptoms cause significant problems in social or work situations and in relationships. They can also interfere with your ability to go about your normal daily tasks. PTSD symptoms are generally grouped into four types: intrusive memories, avoidance, negative changes in thinking and mood, and changes in physical and emotional reactions. Symptoms can vary over time or vary from person to person. Intrusive memories Symptoms of intrusive memories may include: Recurrent, unwanted distressing memories of the traumatic event Reliving the traumatic event as if it were happening again (flashbacks) Upsetting dreams or nightmares about the traumatic event Severe emotional distress or physical reactions to something that reminds you of the traumatic event Avoidance Symptoms of avoidance may include: Trying to avoid thinking or talking about the traumatic event Avoiding places, activities or people that remind you of the traumatic event Negative changes in thinking and mood Symptoms of negative changes in thinking and mood may include: Negative thoughts about yourself, other people or the world Hopelessness about the future Memory problems, including not remembering important aspects of the traumatic event Difficulty maintaining close relationships Feeling detached from family and friends Lack of interest in activities you once enjoyed Difficulty experiencing positive emotions Feeling emotionally numb Changes in physical and emotional reactions Symptoms of changes in physical and emotional reactions (also called arousal symptoms) may include: Being easily startled or frightened Always being on guard for danger Self-destructive behavior, such as drinking too much or driving too fast Trouble sleeping Trouble concentrating Irritability, angry outbursts or aggressive behavior Overwhelming guilt or shame For children 6 years old and younger, signs and symptoms may also include: Re-enacting the traumatic event or aspects of the traumatic event through play Frightening dreams that may or may not include aspects of the traumatic event Intensity of symptoms PTSD symptoms can vary in intensity over time. You may have more PTSD symptoms when you're stressed in general, or when you come across reminders of what you went through. For example, you may hear a car backfire and relive combat experiences. Or you may see a report on the news about a sexual assault and feel overcome by memories of your own assault. When to see a doctor If you have disturbing thoughts and feelings about a traumatic event for more than a month, if they're severe, or if you feel you're having trouble getting your life back under control, talk to your doctor or a mental health professional. Getting treatment as soon as possible can help prevent PTSD symptoms from getting worse. If you have suicidal thoughts If you or someone you know has suicidal thoughts, get help right away through one or more of these resources: Reach out to a close friend or loved one. Contact a minister, a spiritual leader or someone in your faith community. Call a suicide hotline number — in the United States, call the National Suicide Prevention Lifeline at 1-800-273-TALK (1-800-273-8255) to reach a trained counselor. Use that same number and press 1 to reach the Veterans Crisis Line. Make an appointment with your doctor or a mental health professional. When to get emergency help If you think you may hurt yourself or attempt suicide, call 911 or your local emergency number immediately. If you know someone who's in danger of attempting suicide or has made a suicide attempt, make sure someone stays with that person to keep him or her safe. Call 911 or your local emergency number immediately. Or, if you can do so safely, take the person to the nearest hospital emergency room. "}, {"illness": "Seasonal affective disorder (SAD)", "url": "https://www.mayoclinic.org/diseases-conditions/seasonal-affective-disorder/symptoms-causes/syc-20364651", "symptoms": "In most cases, seasonal affective disorder symptoms appear during late fall or early winter and go away during the sunnier days of spring and summer. Less commonly, people with the opposite pattern have symptoms that begin in spring or summer. In either case, symptoms may start out mild and become more severe as the season progresses. Signs and symptoms of SAD may include: Feeling listless, sad or down most of the day, nearly every day Losing interest in activities you once enjoyed Having low energy and feeling sluggish Having problems with sleeping too much Experiencing carbohydrate cravings, overeating and weight gain Having difficulty concentrating Feeling hopeless, worthless or guilty Having thoughts of not wanting to live Fall and winter SAD Symptoms specific to winter-onset SAD, sometimes called winter depression, may include: Oversleeping Appetite changes, especially a craving for foods high in carbohydrates Weight gain Tiredness or low energy Spring and summer SAD Symptoms specific to summer-onset seasonal affective disorder, sometimes called summer depression, may include: Trouble sleeping (insomnia) Poor appetite Weight loss Agitation or anxiety Increased irritability Seasonal changes and bipolar disorder People who have bipolar disorder are at increased risk of seasonal affective disorder. In some people with bipolar disorder, episodes of mania may be linked to a specific season. For example, spring and summer can bring on symptoms of mania or a less intense form of mania (hypomania), anxiety, agitation and irritability. They may also experience depression during the fall and winter months. When to see a doctor It's normal to have some days when you feel down. But if you feel down for days at a time and you can't get motivated to do activities you normally enjoy, see your health care provider. This is especially important if your sleep patterns and appetite have changed, you turn to alcohol for comfort or relaxation, or you feel hopeless or think about suicide. "}, {"illness": "Diabetes", "url": "https://www.mayoclinic.org/diseases-conditions/diabetes/symptoms-causes/syc-20371444", "symptoms": "Diabetes symptoms vary depending on how much your blood sugar is elevated. Some people, especially those with prediabetes or type 2 diabetes, may sometimes not experience symptoms. In type 1 diabetes, symptoms tend to come on quickly and be more severe. Some of the signs and symptoms of type 1 diabetes and type 2 diabetes are: Increased thirst Frequent urination Extreme hunger Unexplained weight loss Presence of ketones in the urine (ketones are a byproduct of the breakdown of muscle and fat that happens when there's not enough available insulin) Fatigue Irritability Blurred vision Slow-healing sores Frequent infections, such as gums or skin infections and vaginal infections Type 1 diabetes can develop at any age, though it often appears during childhood or adolescence. Type 2 diabetes, the more common type, can develop at any age, though it's more common in people older than 40. When to see a doctor If you suspect you or your child may have diabetes. If you notice any possible diabetes symptoms, contact your doctor. The earlier the condition is diagnosed, the sooner treatment can begin. If you've already been diagnosed with diabetes. After you receive your diagnosis, you'll need close medical follow-up until your blood sugar levels stabilize. "}, {"illness": "Appendicitis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/13/ds00274_im01218_r7_appendicitisthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/appendicitis/symptoms-causes/syc-20369543", "symptoms": "Signs and symptoms of appendicitis may include: Sudden pain that begins on the right side of the lower abdomen Sudden pain that begins around your navel and often shifts to your lower right abdomen Pain that worsens if you cough, walk or make other jarring movements Nausea and vomiting Loss of appetite Low-grade fever that may worsen as the illness progresses Constipation or diarrhea Abdominal bloating Flatulence The site of your pain may vary, depending on your age and the position of your appendix. When you're pregnant, the pain may seem to come from your upper abdomen because your appendix is higher during pregnancy. When to see a doctor Make an appointment with a doctor if you or your child has worrisome signs or symptoms. Severe abdominal pain requires immediate medical attention. "}, {"illness": "Ulcerative colitis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/40/ds00104_-ds00598_-ds00705_-ds00736_-ds00797_-ds00824_-ds00825_-ds01195_-my00141_-my00312_im00235_d7_colonrectalthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/ulcerative-colitis/symptoms-causes/syc-20353326", "symptoms": "Ulcerative colitis symptoms can vary, depending on the severity of inflammation and where it occurs. Signs and symptoms may include: Diarrhea, often with blood or pus Abdominal pain and cramping Rectal pain Rectal bleeding — passing small amount of blood with stool Urgency to defecate Inability to defecate despite urgency Weight loss Fatigue Fever In children, failure to grow Most people with ulcerative colitis have mild to moderate symptoms. The course of ulcerative colitis may vary, with some people having long periods of remission. Types Doctors often classify ulcerative colitis according to its location. Types of ulcerative colitis include: Ulcerative proctitis. Inflammation is confined to the area closest to the anus (rectum), and rectal bleeding may be the only sign of the disease. Proctosigmoiditis. Inflammation involves the rectum and sigmoid colon — the lower end of the colon. Signs and symptoms include bloody diarrhea, abdominal cramps and pain, and an inability to move the bowels in spite of the urge to do so (tenesmus). Left-sided colitis. Inflammation extends from the rectum up through the sigmoid and descending colon. Signs and symptoms include bloody diarrhea, abdominal cramping and pain on the left side, and urgency to defecate. Pancolitis. This type often affects the entire colon and causes bouts of bloody diarrhea that may be severe, abdominal cramps and pain, fatigue, and significant weight loss. When to see a doctor See your doctor if you experience a persistent change in your bowel habits or if you have signs and symptoms such as: Abdominal pain Blood in your stool Ongoing diarrhea that doesn't respond to over-the-counter medications Diarrhea that awakens you from sleep An unexplained fever lasting more than a day or two Although ulcerative colitis usually isn't fatal, it's a serious disease that, in some cases, may cause life-threatening complications. "}, {"illness": "Crohn's disease", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/40/ds00104_-ds00598_-ds00705_-ds00736_-ds00797_-ds00824_-ds00825_-ds01195_-my00141_-my00312_im00235_d7_colonrectalthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/crohns-disease/symptoms-causes/syc-20353304", "symptoms": "Digestive system Digestive system Digestive system Crohn's disease and ulcerative colitis are both forms of inflammatory bowel disease. Crohn's disease most commonly affects the colon and the last part of the small intestine (ileum). Ulcerative colitis affects only the colon. In Crohn's disease, any part of your small or large intestine can be involved, and it may be continuous or may involve multiple segments. In some people, the disease is confined to the colon, which is part of the large intestine. Signs and symptoms of Crohn's disease can range from mild to severe. They usually develop gradually, but sometimes will come on suddenly, without warning. You may also have periods of time when you have no signs or symptoms (remission). When the disease is active, signs and symptoms may include: Diarrhea Fever Fatigue Abdominal pain and cramping Blood in your stool Mouth sores Reduced appetite and weight loss Pain or drainage near or around the anus due to inflammation from a tunnel into the skin (fistula) Other signs and symptoms People with severe Crohn's disease may also experience: Inflammation of skin, eyes and joints Inflammation of the liver or bile ducts Kidney stones Iron deficiency (anemia) Delayed growth or sexual development, in children When to see a doctor See your doctor if you have persistent changes in your bowel habits or if you have any of the signs and symptoms of Crohn's disease, such as: Abdominal pain Blood in your stool Nausea and vomiting Ongoing bouts of diarrhea that don't respond to over-the-counter (OTC) medications Unexplained fever lasting more than a day or two Unexplained weight loss "}, {"illness": "Lactose intolerance", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/25/ds00530_im01780_r7_smallintestinethu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/lactose-intolerance/symptoms-causes/syc-20374232", "symptoms": "The signs and symptoms of lactose intolerance usually begin from 30 minutes to two hours after eating or drinking foods that contain lactose. Common signs and symptoms include: Diarrhea Nausea, and sometimes, vomiting Stomach cramps Bloating Gas When to see a doctor Make an appointment with your doctor if you frequently have symptoms of lactose intolerance after eating dairy foods, particularly if you're worried about getting enough calcium. "}, {"illness": "Cataracts", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/14/ds00050_im01228_vi7_cataractthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/cataracts/symptoms-causes/syc-20353790", "symptoms": "Signs and symptoms of cataracts include: Clouded, blurred or dim vision Increasing difficulty with vision at night Sensitivity to light and glare Need for brighter light for reading and other activities Seeing \"halos\" around lights Frequent changes in eyeglass or contact lens prescription Fading or yellowing of colors Double vision in a single eye At first, the cloudiness in your vision caused by a cataract may affect only a small part of the eye's lens and you may be unaware of any vision loss. As the cataract grows larger, it clouds more of your lens and distorts the light passing through the lens. This may lead to more-noticeable symptoms. When to see a doctor Make an appointment for an eye exam if you notice any changes in your vision. If you develop sudden vision changes, such as double vision or flashes of light, sudden eye pain, or sudden headache, see your doctor right away. "}, {"illness": "Glaucoma", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/41/ds00283_im00143_r7_openanglethu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/glaucoma/symptoms-causes/syc-20372839", "symptoms": "The signs and symptoms of glaucoma vary depending on the type and stage of your condition. For example: Open-angle glaucoma Patchy blind spots in your side (peripheral) or central vision, frequently in both eyes Tunnel vision in the advanced stages Acute angle-closure glaucoma Severe headache Eye pain Nausea and vomiting Blurred vision Halos around lights Eye redness If left untreated, glaucoma will eventually cause blindness. Even with treatment, about 15 percent of people with glaucoma become blind in at least one eye within 20 years. When to see a doctor Promptly go to an emergency room or an eye doctor's (ophthalmologist's) office if you experience some of the symptoms of acute angle-closure glaucoma, such as severe headache, eye pain and blurred vision. "}, {"illness": "Pink eye (conjunctivitis)", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/33/ds00258_im02179r7_conjunctivitisthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/pink-eye/symptoms-causes/syc-20376355", "symptoms": "The most common pink eye symptoms include: Redness in one or both eyes Itchiness in one or both eyes A gritty feeling in one or both eyes A discharge in one or both eyes that forms a crust during the night that may prevent your eye or eyes from opening in the morning Tearing When to see a doctor There are serious eye conditions that can cause eye redness. These conditions may cause eye pain, a feeling that something is stuck in your eye (foreign body sensation), blurred vision and light sensitivity. If you experience these symptoms, seek urgent care. People who wear contact lenses need to stop wearing their contacts as soon as pink eye symptoms begin. If your symptoms don't start to get better within 12 to 24 hours, make an appointment with your eye doctor to make sure you don't have a more serious eye infection related to contact lens use. "}, {"illness": "Heart disease", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2014/09/22/12/43/mcdc7_theheart.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/heart-disease/symptoms-causes/syc-20353118", "symptoms": "Heart disease symptoms depend on what type of heart disease you have. Symptoms of heart disease in your blood vessels A buildup of fatty plaques in your arteries, or atherosclerosis (ath-ur-o-skluh-ROE-sis) can damage your blood vessels and heart. Plaque buildup causes narrowed or blocked blood vessels that can lead to a heart attack, chest pain (angina) or stroke. Coronary artery disease symptoms may be different for men and women. For instance, men are more likely to have chest pain. Women are more likely to have other signs and symptoms along with chest discomfort, such as shortness of breath, nausea and extreme fatigue. Signs and symptoms can include: Chest pain, chest tightness, chest pressure and chest discomfort (angina) Shortness of breath Pain, numbness, weakness or coldness in your legs or arms if the blood vessels in those parts of your body are narrowed Pain in the neck, jaw, throat, upper abdomen or back You might not be diagnosed with coronary artery disease until you have a heart attack, angina, stroke or heart failure. It's important to watch for cardiovascular symptoms and discuss concerns with your doctor. Cardiovascular disease can sometimes be found early with regular evaluations. Heart disease symptoms caused by abnormal heartbeats (heart arrhythmias) Your heart may beat too quickly, too slowly or irregularly. Heart arrhythmia signs and symptoms can include: Fluttering in your chest Racing heartbeat (tachycardia) Slow heartbeat (bradycardia) Chest pain or discomfort Shortness of breath Lightheadedness Dizziness Fainting (syncope) or near fainting Heart disease symptoms caused by heart defects Serious heart defects that you're born with (congenital heart defects) usually are noticed soon after birth. Heart defect signs and symptoms in children could include: Pale gray or blue skin color (cyanosis) Swelling in the legs, abdomen or areas around the eyes In an infant, shortness of breath during feedings, leading to poor weight gain Less serious congenital heart defects are often not diagnosed until later in childhood or during adulthood. Signs and symptoms of congenital heart defects that usually aren't immediately life-threatening include: Easily getting short of breath during exercise or activity Easily tiring during exercise or activity Swelling in the hands, ankles or feet Heart disease symptoms caused by diseased heart muscle (cardiomyopathy) In early stages of cardiomyopathy, you may have no symptoms. As the condition worsens, symptoms may include: Breathlessness with activity or at rest Swelling of the legs, ankles and feet Fatigue Irregular heartbeats that feel rapid, pounding or fluttering Dizziness, lightheadedness and fainting Heart disease symptoms caused by heart infection Endocarditis is an infection that affects the inner lining of your heart chambers and heart valves (endocardium). Heart infection signs and symptoms can include: Fever Shortness of breath Weakness or fatigue Swelling in your legs or abdomen Changes in your heart rhythm Dry or persistent cough Skin rashes or unusual spots Heart disease symptoms caused by heart valve problems (valvular heart disease) The heart has four valves — the aortic, mitral, pulmonary and tricuspid valves — that open and close to direct blood flow through your heart. Many things can damage your heart valves, leading to narrowing (stenosis), leaking (regurgitation or insufficiency) or improper closing (prolapse). Depending on which valve isn't working properly, valvular heart disease signs and symptoms generally include: Fatigue Shortness of breath Irregular heartbeat Swollen feet or ankles Chest pain Fainting (syncope) When to see a doctor Seek emergency medical care if you have these heart disease signs and symptoms: Chest pain Shortness of breath Fainting Always call 911 or emergency medical help if you think you might be having a heart attack. Heart disease is easier to treat when detected early, so talk to your doctor about your concerns regarding your heart health. If you're concerned about developing heart disease, talk to your doctor about steps you can take to reduce your heart disease risk. This is especially important if you have a family history of heart disease. If you think you may have heart disease, based on new signs or symptoms you're having, make an appointment to see your doctor. "}, {"illness": "Hepatitis A", "url": "https://www.mayoclinic.org/diseases-conditions/hepatitis-a/symptoms-causes/syc-20367007", "symptoms": "Hepatitis A signs and symptoms typically don't appear until you've had the virus for a few weeks. But not everyone with hepatitis A develops them. If you do, hepatitis signs and symptoms can include: Fatigue Sudden nausea and vomiting Abdominal pain or discomfort, especially on the upper right side beneath your lower ribs (by your liver) Clay-colored bowel movements Loss of appetite Low-grade fever Dark urine Joint pain Yellowing of the skin and the whites of your eyes (jaundice) Intense itching These symptoms may be relatively mild and go away in a few weeks. Sometimes, however, hepatitis A infection results in a severe illness that lasts several months. When to see a doctor Make an appointment with your doctor if you have signs or symptoms of hepatitis A. Getting a hepatitis A vaccine or an injection of immunoglobulin (an antibody) within two weeks of exposure to hepatitis A may protect you from infection. Ask your doctor or your local health department about receiving the hepatitis A vaccine if: You've traveled out of the country recently, particularly to Mexico or South or Central America, or to areas with poor sanitation A restaurant where you recently ate reports a hepatitis A outbreak Someone close to you, such as a roommate or caregiver, is diagnosed with hepatitis A You recently had sexual contact with someone who has hepatitis A "}, {"illness": "Hepatitis B", "url": "https://www.mayoclinic.org/diseases-conditions/hepatitis-b/symptoms-causes/syc-20366802", "symptoms": "Signs and symptoms of hepatitis B range from mild to severe. They usually appear about one to four months after you've been infected, although you could see them as early as two weeks post-infection. Some people, usually young children, may not have any symptoms. Hepatitis B signs and symptoms may include: Abdominal pain Dark urine Fever Joint pain Loss of appetite Nausea and vomiting Weakness and fatigue Yellowing of your skin and the whites of your eyes (jaundice) When to see a doctor If you know you've been exposed to hepatitis B, contact your doctor immediately. A preventive treatment may reduce your risk of infection if you receive the treatment within 24 hours of exposure to the virus. If you think you have signs or symptoms of hepatitis B, contact your doctor. "}, {"illness": "Hepatitis C", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/40/ds00097_-ds00373_-ds00398_-ds00399_-ds00411_-ds00455_-ds00676_-ds00743_-ds00785_-ds00811_-ds00961_-ds01125_-ds01133_-my00349_im02250_r7_liverthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/hepatitis-c/symptoms-causes/syc-20354278", "symptoms": "Long-term infection with the hepatitis C virus is known as chronic hepatitis C. Chronic hepatitis C is usually a \"silent\" infection for many years, until the virus damages the liver enough to cause the signs and symptoms of liver disease. Signs and symptoms include: Bleeding easily Bruising easily Fatigue Poor appetite Yellow discoloration of the skin and eyes (jaundice) Dark-colored urine Itchy skin Fluid buildup in your abdomen (ascites) Swelling in your legs Weight loss Confusion, drowsiness and slurred speech (hepatic encephalopathy) Spiderlike blood vessels on your skin (spider angiomas) Every chronic hepatitis C infection starts with an acute phase. Acute hepatitis C usually goes undiagnosed because it rarely causes symptoms. When signs and symptoms are present, they may include jaundice, along with fatigue, nausea, fever and muscle aches. Acute symptoms appear one to three months after exposure to the virus and last two weeks to three months. Acute hepatitis C infection doesn't always become chronic. Some people clear HCV from their bodies after the acute phase, an outcome known as spontaneous viral clearance. In studies of people diagnosed with acute HCV, rates of spontaneous viral clearance have varied from 15% to 25%. Acute hepatitis C also responds well to antiviral therapy. "}, {"illness": "Pulmonary hypertension", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/11/r7_pulmonaryhypertens-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/pulmonary-hypertension/symptoms-causes/syc-20350697", "symptoms": "The signs and symptoms of pulmonary hypertension develop slowly. You may not notice them for months or even years. Symptoms get worse as the disease progresses. Pulmonary hypertension signs and symptoms include: Shortness of breath (dyspnea), initially while exercising and eventually while at rest Fatigue Dizziness or fainting spells (syncope) Chest pressure or pain Swelling (edema) in the ankles, legs and eventually the abdomen (ascites) Bluish color to the lips and skin (cyanosis) Fast pulse or pounding heartbeat (palpitations) "}, {"illness": "HIV/AIDS", "url": "https://www.mayoclinic.org/diseases-conditions/hiv-aids/symptoms-causes/syc-20373524", "symptoms": "The symptoms of HIV and AIDS vary, depending on the phase of infection. Primary infection (Acute HIV) Some people infected by HIV develop a flu-like illness within 2 to 4 weeks after the virus enters the body. This illness, known as primary (acute) HIV infection, may last for a few weeks. Possible signs and symptoms include: Fever Headache Muscle aches and joint pain Rash Sore throat and painful mouth sores Swollen lymph glands, mainly on the neck Diarrhea Weight loss Cough Night sweats These symptoms can be so mild that you might not even notice them. However, the amount of virus in your bloodstream (viral load) is quite high at this time. As a result, the infection spreads more easily during primary infection than during the next stage. Clinical latent infection (Chronic HIV) In this stage of infection, HIV is still present in the body and in white blood cells. However, many people may not have any symptoms or infections during this time. This stage can last for many years if you're not receiving antiretroviral therapy (ART). Some people develop more severe disease much sooner. Symptomatic HIV infection As the virus continues to multiply and destroy your immune cells — the cells in your body that help fight off germs — you may develop mild infections or chronic signs and symptoms such as: Fever Fatigue Swollen lymph nodes — often one of the first signs of HIV infection Diarrhea Weight loss Oral yeast infection (thrush) Shingles (herpes zoster) Pneumonia Progression to AIDS Access to better antiviral treatments has dramatically decreased deaths from AIDS worldwide, even in resource-poor countries. Thanks to these life-saving treatments, most people with HIV in the U.S. today don't develop AIDS. Untreated, HIV typically turns into AIDS in about 8 to 10 years. When AIDS occurs, your immune system has been severely damaged. You'll be more likely to develop diseases that wouldn't usually cause illness in a person with a healthy immune system. These are called opportunistic infections or opportunistic cancers. The signs and symptoms of some of these infections may include: Sweats Chills Recurring fever Chronic diarrhea Swollen lymph glands Persistent white spots or unusual lesions on your tongue or in your mouth Persistent, unexplained fatigue Weakness Weight loss Skin rashes or bumps When to see a doctor If you think you may have been infected with HIV or are at risk of contracting the virus, see a health care provider as soon as possible. "}, {"illness": "Dengue fever", "url": "https://www.mayoclinic.org/diseases-conditions/dengue-fever/symptoms-causes/syc-20353078", "symptoms": "Many people experience no signs or symptoms of a dengue infection. When symptoms do occur, they may be mistaken for other illnesses — such as the flu — and usually begin four to 10 days after you are bitten by an infected mosquito. Dengue fever causes a high fever — 104 F (40 C) — and any of the following signs and symptoms: Headache Muscle, bone or joint pain Nausea Vomiting Pain behind the eyes Swollen glands Rash Most people recover within a week or so. In some cases, symptoms worsen and can become life-threatening. This is called severe dengue, dengue hemorrhagic fever or dengue shock syndrome. Severe dengue happens when your blood vessels become damaged and leaky. And the number of clot-forming cells (platelets) in your bloodstream drops. This can lead to shock, internal bleeding, organ failure and even death. Warning signs of severe dengue fever — which is a life-threatening emergency — can develop quickly. The warning signs usually begin the first day or two after your fever goes away, and may include: Severe stomach pain Persistent vomiting Bleeding from your gums or nose Blood in your urine, stools or vomit Bleeding under the skin, which might look like bruising Difficult or rapid breathing Fatigue Irritability or restlessness When to see a doctor Severe dengue fever is a life-threatening medical emergency. Seek immediate medical attention if you've recently visited an area in which dengue fever is known to occur, you have had a fever and you develop any of the warning signs. Warning signs include severe stomach pain, vomiting, difficulty breathing, or blood in your nose, gums, vomit or stools. If you've been traveling recently and develop a fever and mild symptoms of dengue fever, call your doctor. "}, {"illness": "Malaria", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/13/ds00475_im00175_mcdc7_malaria_transmitthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/malaria/symptoms-causes/syc-20351184", "symptoms": "Signs and symptoms of malaria may include: Fever Chills General feeling of discomfort Headache Nausea and vomiting Diarrhea Abdominal pain Muscle or joint pain Fatigue Rapid breathing Rapid heart rate Cough Some people who have malaria experience cycles of malaria \"attacks.\" An attack usually starts with shivering and chills, followed by a high fever, followed by sweating and a return to normal temperature. Malaria signs and symptoms typically begin within a few weeks after being bitten by an infected mosquito. However, some types of malaria parasites can lie dormant in your body for up to a year. When to see a doctor Talk to your doctor if you experience a fever while living in or after traveling to a high-risk malaria region. If you have severe symptoms, seek emergency medical attention. "}, {"illness": "Meningitis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/11/04/ds00118_im00113_r7_im00113_meningitisthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/meningitis/symptoms-causes/syc-20350508", "symptoms": "Early meningitis symptoms may mimic the flu (influenza). Symptoms may develop over several hours or over a few days. Possible signs and symptoms in anyone older than the age of 2 include: Sudden high fever Stiff neck Severe headache that seems different from normal Headache with nausea or vomiting Confusion or difficulty concentrating Seizures Sleepiness or difficulty waking Sensitivity to light No appetite or thirst Skin rash (sometimes, such as in meningococcal meningitis) Signs in newborns Newborns and infants may show these signs: High fever Constant crying Excessive sleepiness or irritability Difficulty waking from sleep Inactivity or sluggishness Not waking to eat Poor feeding Vomiting A bulge in the soft spot on top of a baby's head (fontanel) Stiffness in the body and neck Infants with meningitis may be difficult to comfort, and may even cry harder when held. When to see a doctor Seek immediate medical care if you or someone in your family has meningitis signs or symptoms, such as: Fever Severe, unrelenting headache Confusion Vomiting Stiff neck Bacterial meningitis is serious and can be fatal within days without prompt antibiotic treatment. Delayed treatment increases the risk of permanent brain damage or death. It's also important to talk to your doctor if a family member or someone you live or work with has meningitis. You may need to take medications to prevent getting the infection. "}, {"illness": "Staph infections", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/43/ds00735_-ds00973_im03126_ans7_staph_skinthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/staph-infections/symptoms-causes/syc-20356221", "symptoms": "Staph infection Staph infection Staph infection MRSA infections start out as small red bumps that can quickly turn into deep, painful abscesses. Staph infections can range from minor skin problems to endocarditis, a life-threatening infection of the inner lining of your heart (endocardium). Because of this, signs and symptoms of staph infections vary widely, depending on the location and severity of the infection. Skin infections Skin infections caused by staph bacteria include: Boils. The most common type of staph infection is the boil, a pocket of pus that develops in a hair follicle or oil gland. The skin over the infected area usually becomes red and swollen. If a boil breaks open, it will probably drain pus. Boils occur most often under the arms or around the groin or buttocks. Impetigo. This contagious, often painful rash can be caused by staph bacteria. Impetigo usually features large blisters that may ooze fluid and develop a honey-colored crust. Cellulitis. Cellulitis — an infection of the deeper layers of skin — causes skin redness and swelling on the surface of your skin. Sores or areas of oozing discharge may develop, too. Staphylococcal scalded skin syndrome. Toxins produced as a result of a staph infection may lead to staphylococcal scalded skin syndrome. Affecting mostly babies and children, this condition features a fever, a rash and sometimes blisters. When the blisters break, the top layer of skin comes off — leaving a red, raw surface that looks like a burn. Food poisoning Staph bacteria are one of the most common causes of food poisoning. Symptoms come on quickly, usually within hours of eating a contaminated food. Symptoms usually disappear quickly, too, often lasting just half a day. A staph infection in food usually doesn't cause a fever. Signs and symptoms you can expect with this type of staph infection include: Nausea and vomiting Diarrhea Dehydration Low blood pressure Bacteremia Also known as a bloodstream infection, bacteremia occurs when staph bacteria enter a person's bloodstream. A fever and low blood pressure are signs of bacteremia. The bacteria can travel to locations deep within your body, to produce infections affecting: Internal organs, such as your brain, heart or lungs Bones and muscles Surgically implanted devices, such as artificial joints or cardiac pacemakers Toxic shock syndrome This life-threatening condition results from toxins produced by some strains of staph bacteria and has been linked to certain types of tampons, skin wounds and surgery. It usually develops suddenly with: A high fever Nausea and vomiting A rash on your palms and soles that resembles a sunburn Confusion Muscle aches Diarrhea Stomach pain Septic arthritis Septic arthritis is often caused by a staph infection. The bacteria often target the knees, shoulders, hips, and fingers or toes. Signs and symptoms may include: Joint swelling Severe pain in the affected joint Fever When to see a doctor Go to the doctor if you or your child has: An area of red, irritated or painful skin Pus-filled blisters Fever You may also want to consult your doctor if: Skin infections are being passed from one family member to another Two or more family members have skin infections at the same time "}, {"illness": "Oral thrush", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2017/07/21/17/26/oral-thrush-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/oral-thrush/symptoms-causes/syc-20353533", "symptoms": "Children and adults Initially, you may not even notice symptoms of oral thrush. Signs and symptoms may include: Creamy white lesions on your tongue, inner cheeks, and sometimes on the roof of your mouth, gums and tonsils Slightly raised lesions with a cottage cheese-like appearance Redness, burning or soreness that may be severe enough to cause difficulty eating or swallowing Slight bleeding if the lesions are rubbed or scraped Cracking and redness at the corners of your mouth A cottony feeling in your mouth Loss of taste Redness, irritation and pain under dentures (denture stomatitis) In severe cases, usually related to cancer or a weakened immune system from HIV/AIDS, the lesions may spread downward into your esophagus — the long, muscular tube stretching from the back of your mouth to your stomach (Candida esophagitis). If this occurs, you may experience difficulty swallowing and pain or feel as if food is getting stuck in your throat. Infants and breast-feeding mothers In addition to the distinctive white mouth lesions, infants may have trouble feeding or be fussy and irritable. They can pass the infection to their mothers during breast-feeding. The infection may then pass back and forth between the mother's breasts and the baby's mouth. Women whose breasts are infected with candida may experience these signs and symptoms: Unusually red, sensitive, cracked or itchy nipples Shiny or flaky skin on the darker, circular area around the nipple (areola) Unusual pain during nursing or painful nipples between feedings Stabbing pains deep within the breast When to see a doctor If you or your child develops white lesions inside the mouth, see your doctor or dentist. Thrush is uncommon in healthy older children, teenagers and adults, so if thrush develops, see your doctor to determine if further evaluation is needed to check for an underlying medical condition or other cause. "}, {"illness": "Hemochromatosis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/40/ds00097_-ds00373_-ds00398_-ds00399_-ds00411_-ds00455_-ds00676_-ds00743_-ds00785_-ds00811_-ds00961_-ds01125_-ds01133_-my00349_im02250_r7_liverthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/hemochromatosis/symptoms-causes/syc-20351443", "symptoms": "Some people with hereditary hemochromatosis never have symptoms. Early signs and symptoms often overlap with those of other common conditions. Signs and symptoms may include: Joint pain Abdominal pain Fatigue Weakness Diabetes Loss of sex drive Impotence Heart failure Liver failure Bronze or gray skin color Memory fog When signs and symptoms typically appear Hereditary hemochromatosis is present at birth. But most people don't experience signs and symptoms until later in life — usually after the age of 40 in men and after age 60 in women. Women are more likely to develop symptoms after menopause, when they no longer lose iron with menstruation and pregnancy. When to see a doctor See your doctor if you experience any of the signs and symptoms of hereditary hemochromatosis. If you have an immediate family member who has hemochromatosis, ask your doctor about genetic tests that can determine if you have inherited the gene that increases your risk of hemochromatosis. "}, {"illness": "COPD", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/40/ds00916_-ds00296_im04560_mcdc7_emphysemathu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/copd/symptoms-causes/syc-20353679", "symptoms": "COPD symptoms often don't appear until significant lung damage has occurred, and they usually worsen over time, particularly if smoking exposure continues. Signs and symptoms of COPD may include: Shortness of breath, especially during physical activities Wheezing Chest tightness A chronic cough that may produce mucus (sputum) that may be clear, white, yellow or greenish Frequent respiratory infections Lack of energy Unintended weight loss (in later stages) Swelling in ankles, feet or legs People with COPD are also likely to experience episodes called exacerbations, during which their symptoms become worse than the usual day-to-day variation and persist for at least several days. When to see a doctor Talk to your doctor if your symptoms are not improving with treatment or getting worse, or if you notice symptoms of an infection, such as fever or a change in sputum. Seek immediate medical care if you can't catch your breath, if you experience severe blueness of your lips or fingernail beds (cyanosis) or a rapid heartbeat, or if you feel foggy and have trouble concentrating. "}, {"illness": "Severe acute respiratory syndrome (SARS)", "url": "https://www.mayoclinic.org/diseases-conditions/sars/symptoms-causes/syc-20351765", "symptoms": "SARS usually begins with flu-like signs and symptoms — fever, chills, muscle aches, headache and occasionally diarrhea. After about a week, signs and symptoms include: Fever of 100.5 F (38 C) or higher Dry cough Shortness of breath When to see a doctor SARS is a serious illness that can lead to death. If you have signs or symptoms of a respiratory infection, or if you have flu-like signs and symptoms with fever after traveling abroad, see your doctor right away. "}, {"illness": "Coronavirus disease 2019 (COVID-19)", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2020/02/12/16/17/coronovirus-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/coronavirus/symptoms-causes/syc-20479963", "symptoms": "Signs and symptoms of coronavirus disease 2019 (COVID-19) may appear 2 to 14 days after exposure. This time after exposure and before having symptoms is called the incubation period. You can still spread COVID-19 before you have symptoms (presymptomatic transmission). Common signs and symptoms can include: Fever Cough Tiredness Early symptoms of COVID-19 may include a loss of taste or smell. Other symptoms can include: Shortness of breath or difficulty breathing Muscle aches Chills Sore throat Runny nose Headache Chest pain Pink eye (conjunctivitis) Nausea Vomiting Diarrhea Rash This list isn't complete. Children have similar symptoms to adults and generally have mild illness. The severity of COVID-19 symptoms can range from very mild to severe. Some people may have only a few symptoms. Some people may have no symptoms at all, but can still spread it (asymptomatic transmission). Some people may experience worsened symptoms, such as worsened shortness of breath and pneumonia, about a week after symptoms start. Some people experience COVID-19 symptoms for more than four weeks after they're diagnosed. These health issues are sometimes called post- COVID-19 conditions. Some children experience multisystem inflammatory syndrome, a syndrome that can affect some organs and tissues, several weeks after having COVID-19. Rarely, some adults experience the syndrome too. People who are older have a higher risk of serious illness from COVID-19, and the risk increases with age. People who have existing medical conditions also may have a higher risk of serious illness. Certain medical conditions that may increase the risk of serious illness from COVID-19 include: Serious heart diseases, such as heart failure, coronary artery disease or cardiomyopathy Cancer Chronic obstructive pulmonary disease (COPD) Type 1 or type 2 diabetes Overweight, obesity or severe obesity High blood pressure Smoking Chronic kidney disease Sickle cell disease or thalassemia Weakened immune system from solid organ transplants or bone marrow transplants Pregnancy Asthma Chronic lung diseases such as cystic fibrosis or pulmonary hypertension Liver disease Dementia Down syndrome Weakened immune system from bone marrow transplant, HIV or some medications Brain and nervous system conditions, such as strokes Substance use disorders This list is not complete. Other medical conditions may increase your risk of serious illness from COVID-19. COVID-19 self-checker Assess your symptoms on CDC’s coronavirus self-checker tool and find out if you’re a candidate for a COVID-19 test. When to see a doctor If you have COVID-19 signs or symptoms or you've been in contact with someone diagnosed with COVID-19, contact your health care provider right away for medical advice. Your health care provider will likely recommend that you get tested for COVID-19. If you have emergency COVID-19 symptoms, such as trouble breathing, seek care immediately. If you need to go to a hospital, call ahead so that health care providers can take steps to ensure that others aren't exposed. If you have emergency COVID-19 signs and symptoms, seek care immediately. Emergency signs and symptoms can include: Trouble breathing Persistent chest pain or pressure Inability to stay awake New confusion Pale, gray or blue-colored skin, lips or nail beds — depending on skin tone This list isn't complete. Let your health care provider know if you are an older adult or have chronic medical conditions, such as heart disease or lung disease, as you may have a greater risk of becoming seriously ill with COVID-19. "}, {"illness": "Emphysema", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/40/ds00916_-ds00296_im04560_mcdc7_emphysemathu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/emphysema/symptoms-causes/syc-20355555", "symptoms": "You can have emphysema for many years without noticing any signs or symptoms. The main symptom of emphysema is shortness of breath, which usually begins gradually. You may start avoiding activities that cause you to be short of breath, so the symptom doesn't become a problem until it starts interfering with daily tasks. Emphysema eventually causes shortness of breath even while you're at rest. When to see a doctor See your doctor if you've had unexplained shortness of breath for several months, especially if it's getting worse or it's interfering with your daily activities. Don't ignore it by telling yourself it's because you're aging or out of shape. Seek immediate medical attention if: You're so short of breath, you can't climb stairs Your lips or fingernails turn blue or gray with exertion You're not mentally alert "}, {"illness": "Anxiety disorders", "url": "https://www.mayoclinic.org/diseases-conditions/anxiety/symptoms-causes/syc-20350961", "symptoms": "Common anxiety signs and symptoms include: Feeling nervous, restless or tense Having a sense of impending danger, panic or doom Having an increased heart rate Breathing rapidly (hyperventilation) Sweating Trembling Feeling weak or tired Trouble concentrating or thinking about anything other than the present worry Having trouble sleeping Experiencing gastrointestinal (GI) problems Having difficulty controlling worry Having the urge to avoid things that trigger anxiety Several types of anxiety disorders exist: Agoraphobia (ag-uh-ruh-FOE-be-uh) is a type of anxiety disorder in which you fear and often avoid places or situations that might cause you to panic and make you feel trapped, helpless or embarrassed. Anxiety disorder due to a medical condition includes symptoms of intense anxiety or panic that are directly caused by a physical health problem. Generalized anxiety disorder includes persistent and excessive anxiety and worry about activities or events — even ordinary, routine issues. The worry is out of proportion to the actual circumstance, is difficult to control and affects how you feel physically. It often occurs along with other anxiety disorders or depression. Panic disorder involves repeated episodes of sudden feelings of intense anxiety and fear or terror that reach a peak within minutes (panic attacks). You may have feelings of impending doom, shortness of breath, chest pain, or a rapid, fluttering or pounding heart (heart palpitations). These panic attacks may lead to worrying about them happening again or avoiding situations in which they've occurred. Selective mutism is a consistent failure of children to speak in certain situations, such as school, even when they can speak in other situations, such as at home with close family members. This can interfere with school, work and social functioning. Separation anxiety disorder is a childhood disorder characterized by anxiety that's excessive for the child's developmental level and related to separation from parents or others who have parental roles. Social anxiety disorder (social phobia) involves high levels of anxiety, fear and avoidance of social situations due to feelings of embarrassment, self-consciousness and concern about being judged or viewed negatively by others. Specific phobias are characterized by major anxiety when you're exposed to a specific object or situation and a desire to avoid it. Phobias provoke panic attacks in some people. Substance-induced anxiety disorder is characterized by symptoms of intense anxiety or panic that are a direct result of misusing drugs, taking medications, being exposed to a toxic substance or withdrawal from drugs. Other specified anxiety disorder and unspecified anxiety disorder are terms for anxiety or phobias that don't meet the exact criteria for any other anxiety disorders but are significant enough to be distressing and disruptive. When to see a doctor See your doctor if: You feel like you're worrying too much and it's interfering with your work, relationships or other parts of your life Your fear, worry or anxiety is upsetting to you and difficult to control You feel depressed, have trouble with alcohol or drug use, or have other mental health concerns along with anxiety You think your anxiety could be linked to a physical health problem You have suicidal thoughts or behaviors — if this is the case, seek emergency treatment immediately Your worries may not go away on their own, and they may get worse over time if you don't seek help. See your doctor or a mental health provider before your anxiety gets worse. It's easier to treat if you get help early. "}, {"illness": "Body dysmorphic disorder", "url": "https://www.mayoclinic.org/diseases-conditions/body-dysmorphic-disorder/symptoms-causes/syc-20353938", "symptoms": "Signs and symptoms of body dysmorphic disorder include: Being extremely preoccupied with a perceived flaw in appearance that to others can't be seen or appears minor Strong belief that you have a defect in your appearance that makes you ugly or deformed Belief that others take special notice of your appearance in a negative way or mock you Engaging in behaviors aimed at fixing or hiding the perceived flaw that are difficult to resist or control, such as frequently checking the mirror, grooming or skin picking Attempting to hide perceived flaws with styling, makeup or clothes Constantly comparing your appearance with others Frequently seeking reassurance about your appearance from others Having perfectionist tendencies Seeking cosmetic procedures with little satisfaction Avoiding social situations Preoccupation with your appearance and excessive thoughts and repetitive behaviors can be unwanted, difficult to control and so time-consuming that they can cause major distress or problems in your social life, work, school or other areas of functioning. You may excessively focus over one or more parts of your body. The bodily feature that you focus on may change over time. The most common features people tend to fixate about include: Face, such as nose, complexion, wrinkles, acne and other blemishes Hair, such as appearance, thinning and baldness Skin and vein appearance Breast size Muscle size and tone Genitalia A preoccupation with your body build being too small or not muscular enough (muscle dysmorphia) occurs almost exclusively in males. Insight about body dysmorphic disorder varies. You may recognize that your beliefs about your perceived flaws may be excessive or not be true, or think that they probably are true, or be absolutely convinced that they're true. The more convinced you are of your beliefs, the more distress and disruption you may experience in your life. When to see a doctor Shame and embarrassment about your appearance may keep you from seeking treatment for body dysmorphic disorder. But if you have any signs or symptoms, see your health care provider or a mental health professional. Body dysmorphic disorder usually doesn't get better on its own. If left untreated, it may get worse over time, leading to anxiety, extensive medical bills, severe depression, and even suicidal thoughts and behavior. If you have suicidal thoughts Suicidal thoughts and behavior are common with body dysmorphic disorder. If you think you may hurt yourself or attempt suicide, get help right away: In the U.S, call 911 or your local emergency number immediately. Call a suicide hotline number. In the U.S., call the National Suicide Prevention Lifeline at 1-800-273-TALK ( 1-800-273-8255 ) or use its webchat at suicidepreventionlifeline.org/chat. Call your mental health professional. Seek help from your primary care provider. Reach out to a close friend or loved one. Contact a minister, spiritual leader or someone else in your faith community. "}, {"illness": "Postpartum depression", "url": "https://www.mayoclinic.org/diseases-conditions/postpartum-depression/symptoms-causes/syc-20376617", "symptoms": "Signs and symptoms of depression after childbirth vary, and they can range from mild to severe. Baby blues symptoms Signs and symptoms of baby blues — which last only a few days to a week or two after your baby is born — may include: Mood swings Anxiety Sadness Irritability Feeling overwhelmed Crying Reduced concentration Appetite problems Trouble sleeping Postpartum depression symptoms Postpartum depression may be mistaken for baby blues at first — but the signs and symptoms are more intense and last longer, and may eventually interfere with your ability to care for your baby and handle other daily tasks. Symptoms usually develop within the first few weeks after giving birth, but may begin earlier ― during pregnancy ― or later — up to a year after birth. Postpartum depression signs and symptoms may include: Depressed mood or severe mood swings Excessive crying Difficulty bonding with your baby Withdrawing from family and friends Loss of appetite or eating much more than usual Inability to sleep (insomnia) or sleeping too much Overwhelming fatigue or loss of energy Reduced interest and pleasure in activities you used to enjoy Intense irritability and anger Fear that you're not a good mother Hopelessness Feelings of worthlessness, shame, guilt or inadequacy Diminished ability to think clearly, concentrate or make decisions Restlessness Severe anxiety and panic attacks Thoughts of harming yourself or your baby Recurrent thoughts of death or suicide Untreated, postpartum depression may last for many months or longer. Postpartum psychosis With postpartum psychosis — a rare condition that typically develops within the first week after delivery — the signs and symptoms are severe. Signs and symptoms may include: Confusion and disorientation Obsessive thoughts about your baby Hallucinations and delusions Sleep disturbances Excessive energy and agitation Paranoia Attempts to harm yourself or your baby Postpartum psychosis may lead to life-threatening thoughts or behaviors and requires immediate treatment. Postpartum depression in new fathers New fathers can experience postpartum depression, too. They may feel sad or fatigued, be overwhelmed, experience anxiety, or have changes in their usual eating and sleeping patterns ― the same symptoms mothers with postpartum depression experience. Fathers who are young, have a history of depression, experience relationship problems or are struggling financially are most at risk of postpartum depression. Postpartum depression in fathers ― sometimes called paternal postpartum depression ― can have the same negative effect on partner relationships and child development as postpartum depression in mothers can. If you're a new father and are experiencing symptoms of depression or anxiety during your partner's pregnancy or in the first year after your child's birth, talk to your health care professional. Similar treatments and supports provided to mothers with postpartum depression can be beneficial in treating postpartum depression in fathers. When to see a doctor If you're feeling depressed after your baby's birth, you may be reluctant or embarrassed to admit it. But if you experience any symptoms of postpartum baby blues or postpartum depression, call your doctor and schedule an appointment. If you have symptoms that suggest you may have postpartum psychosis, get help immediately. It's important to call your doctor as soon as possible if the signs and symptoms of depression have any of these features: Don't fade after two weeks Are getting worse Make it hard for you to care for your baby Make it hard to complete everyday tasks Include thoughts of harming yourself or your baby If you have suicidal thoughts If at any point you have thoughts of harming yourself or your baby, immediately seek help from your partner or loved ones in taking care of your baby and call 911 or your local emergency assistance number to get help. Also consider these options if you're having suicidal thoughts: Seek help from your primary care provider or other health care professional. Call a mental health professional. Call a suicide hotline. In the U.S., call the National Suicide Prevention Lifeline at 1-800-273-TALK (1-800-273-8255) or use their webchat on suicidepreventionlifeline.org/chat. Reach out to a close friend or loved one. Contact a minister, spiritual leader or someone else in your faith community. Helping a friend or loved one People with depression may not recognize or acknowledge that they're depressed. They may not be aware of signs and symptoms of depression. If you suspect that a friend or loved one has postpartum depression or is developing postpartum psychosis, help them seek medical attention immediately. Don't wait and hope for improvement. "}, {"illness": "Separation anxiety disorder", "url": "https://www.mayoclinic.org/diseases-conditions/separation-anxiety-disorder/symptoms-causes/syc-20377455", "symptoms": "Separation anxiety disorder is diagnosed when symptoms are excessive for the developmental age and cause significant distress in daily functioning. Symptoms may include: Recurrent and excessive distress about anticipating or being away from home or loved ones Constant, excessive worry about losing a parent or other loved one to an illness or a disaster Constant worry that something bad will happen, such as being lost or kidnapped, causing separation from parents or other loved ones Refusing to be away from home because of fear of separation Not wanting to be home alone and without a parent or other loved one in the house Reluctance or refusing to sleep away from home without a parent or other loved one nearby Repeated nightmares about separation Frequent complaints of headaches, stomachaches or other symptoms when separation from a parent or other loved one is anticipated Separation anxiety disorder may be associated with panic disorder and panic attacks ― repeated episodes of sudden feelings of intense anxiety and fear or terror that reach a peak within minutes. When to see a doctor Separation anxiety disorder usually won't go away without treatment and can lead to panic disorder and other anxiety disorders into adulthood. If you have concerns about your child's separation anxiety, talk to your child's pediatrician or other health care provider. "}, {"illness": "Migraine", "url": "https://www.mayoclinic.org/diseases-conditions/migraine-headache/symptoms-causes/syc-20360201", "symptoms": "Migraines, which affect children and teenagers as well as adults, can progress through four stages: prodrome, aura, attack and post-drome. Not everyone who has migraines goes through all stages. Prodrome One or two days before a migraine, you might notice subtle changes that warn of an upcoming migraine, including: Constipation Mood changes, from depression to euphoria Food cravings Neck stiffness Increased urination Fluid retention Frequent yawning Aura For some people, an aura might occur before or during migraines. Auras are reversible symptoms of the nervous system. They're usually visual but can also include other disturbances. Each symptom usually begins gradually, builds up over several minutes and can last up to 60 minutes. Examples of migraine auras include: Visual phenomena, such as seeing various shapes, bright spots or flashes of light Vision loss Pins and needles sensations in an arm or leg Weakness or numbness in the face or one side of the body Difficulty speaking Attack A migraine usually lasts from 4 to 72 hours if untreated. How often migraines occur varies from person to person. Migraines might occur rarely or strike several times a month. During a migraine, you might have: Pain usually on one side of your head, but often on both sides Pain that throbs or pulses Sensitivity to light, sound, and sometimes smell and touch Nausea and vomiting Post-drome After a migraine attack, you might feel drained, confused and washed out for up to a day. Some people report feeling elated. Sudden head movement might bring on the pain again briefly. When to see a doctor Migraines are often undiagnosed and untreated. If you regularly have signs and symptoms of migraine, keep a record of your attacks and how you treated them. Then make an appointment with your doctor to discuss your headaches. Even if you have a history of headaches, see your doctor if the pattern changes or your headaches suddenly feel different. See your doctor immediately or go to the emergency room if you have any of the following signs and symptoms, which could indicate a more serious medical problem: An abrupt, severe headache like a thunderclap Headache with fever, stiff neck, confusion, seizures, double vision, numbness or weakness in any part of the body, which could be a sign of a stroke Headache after a head injury A chronic headache that is worse after coughing, exertion, straining or a sudden movement New headache pain after age 50 "}, {"illness": "Osteoporosis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/55/ds00128_im02980_mcdc7_osteoporosis-_comparethu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/osteoporosis/symptoms-causes/syc-20351968", "symptoms": "There typically are no symptoms in the early stages of bone loss. But once your bones have been weakened by osteoporosis, you might have signs and symptoms that include: Back pain, caused by a fractured or collapsed vertebra Loss of height over time A stooped posture A bone that breaks much more easily than expected When to see a doctor You might want to talk to your doctor about osteoporosis if you went through early menopause or took corticosteroids for several months at a time, or if either of your parents had hip fractures. "}, {"illness": "Measles", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/30/ds00331_im00266_ans7_measlesthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/measles/symptoms-causes/syc-20374857", "symptoms": "Measles signs and symptoms appear around 10 to 14 days after exposure to the virus. Signs and symptoms of measles typically include: Fever Dry cough Runny nose Sore throat Inflamed eyes (conjunctivitis) Tiny white spots with bluish-white centers on a red background found inside the mouth on the inner lining of the cheek — also called Koplik's spots A skin rash made up of large, flat blotches that often flow into one another The infection occurs in a sequence of stages during a period of two to three weeks. Infection and incubation. For the first 10 to 14 days after you're infected, the measles virus incubates. You have no signs or symptoms of measles during this time. Nonspecific signs and symptoms. Measles typically begins with a mild to moderate fever, often accompanied by a persistent cough, runny nose, inflamed eyes (conjunctivitis) and sore throat. This relatively mild illness may last two or three days. Acute illness and rash. The rash consists of small red spots, some of which are slightly raised. Spots and bumps in tight clusters give the skin a splotchy red appearance. The face breaks out first. Over the next few days, the rash spreads down the arms and trunk, then over the thighs, lower legs and feet. At the same time, the fever rises sharply, often as high as 104 to 105.8 F (40 to 41 C). The measles rash gradually recedes, fading first from the face and last from the thighs and feet. Communicable period. A person with measles can spread the virus to others for about eight days, starting four days before the rash appears and ending when the rash has been present for four days. When to see a doctor Call your doctor if you think you or your child may have been exposed to measles or if you or your child has a rash resembling measles. Review your family's vaccination records with your doctor, especially before your children start elementary school or college and before international travel. "}, {"illness": "Mumps", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/43/ds00125_-ds00147_-ds00708_-ha00034_im02997_mcdc7_salivarythu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/mumps/symptoms-causes/syc-20375361", "symptoms": "Mumps Mumps Mumps Mumps is characterized by swollen, painful salivary glands in the face, causing the cheeks to puff out. Some people infected with the mumps virus have either no signs or symptoms or very mild ones. When signs and symptoms do develop, they usually appear about two to three weeks after exposure to the virus. The primary sign of mumps is swollen salivary glands that cause the cheeks to puff out. Other signs and symptoms may include: Pain in the swollen salivary glands on one or both sides of your face Pain while chewing or swallowing Fever Headache Muscle aches Weakness and fatigue Loss of appetite When to see a doctor See your doctor if you or your child has signs and symptoms of mumps. Mumps is highly contagious for about nine days after symptoms appear. Tell your doctor's office before you go in that you suspect mumps so arrangements can be made to avoid spreading the virus to others in the waiting room. In the meantime: Rest as much as possible Try to ease symptoms with cold compresses and over-the-counter pain relievers such as ibuprofen (Advil, Motrin IB, others) and acetaminophen (Tylenol, others) Mumps has become uncommon, so it's possible that another condition is causing your signs and symptoms. Swollen salivary glands and a fever could indicate: A blocked salivary gland A different viral infection "}, {}, {"illness": "Chickenpox", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2021/05/04/22/11/chickenpox-8col-ss-1306371631.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/chickenpox/symptoms-causes/syc-20351282", "symptoms": "The itchy blister rash caused by chickenpox infection appears 10 to 21 days after exposure to the virus and usually lasts about five to 10 days. Other signs and symptoms, which may appear one to two days before the rash, include: Fever Loss of appetite Headache Tiredness and a general feeling of being unwell (malaise) Once the chickenpox rash appears, it goes through three phases: Raised pink or red bumps (papules), which break out over several days Small fluid-filled blisters (vesicles), which form in about one day and then break and leak Crusts and scabs, which cover the broken blisters and take several more days to heal New bumps continue to appear for several days, so you may have all three stages of the rash — bumps, blisters and scabbed lesions — at the same time. You can spread the virus to other people for up to 48 hours before the rash appears, and the virus remains contagious until all broken blisters have crusted over. The disease is generally mild in healthy children. In severe cases, the rash can cover the entire body, and lesions may form in the throat, eyes, and mucous membranes of the urethra, anus and vagina. When to see a doctor If you think you or your child might have chickenpox, consult your doctor. He or she usually can diagnose chickenpox by examining the rash and considering other symptoms. Your doctor can also prescribe medications to lessen the severity of chickenpox and treat complications, if necessary. To avoid infecting others in the waiting room, call ahead for an appointment and mention that you think you or your child may have chickenpox. Also, let your doctor know if: The rash spreads to one or both eyes. The rash gets very red, warm or tender. This could indicate a secondary bacterial skin infection. The rash is accompanied by dizziness, disorientation, rapid heartbeat, shortness of breath, tremors, loss of muscle coordination, worsening cough, vomiting, stiff neck or a fever higher than 102 F (38.9 C). Anyone in the household has a problem with his or her immune system or is younger than 6 months. "}, {"illness": "Shingles", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/10/ds00098_im01000_sn7_shinglesthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/shingles/symptoms-causes/syc-20353054", "symptoms": "Shingles Shingles Shingles Shingles is characterized by pain or a tingling sensation in a limited area on one side of the face or torso, followed by a red rash with small, fluid-filled blisters. The signs and symptoms of shingles usually affect only a small section of one side of your body. These signs and symptoms may include: Pain, burning, numbness or tingling Sensitivity to touch A red rash that begins a few days after the pain Fluid-filled blisters that break open and crust over Itching Some people also experience: Fever Headache Sensitivity to light Fatigue Pain is usually the first symptom of shingles. For some, it can be intense. Depending on the location of the pain, it can sometimes be mistaken for a symptom of problems affecting the heart, lungs or kidneys. Some people experience shingles pain without ever developing the rash. Most commonly, the shingles rash develops as a stripe of blisters that wraps around either the left or right side of your torso. Sometimes the shingles rash occurs around one eye or on one side of the neck or face. When to see a doctor Contact your doctor promptly if you suspect shingles, but especially in the following situations: The pain and rash occur near an eye. If left untreated, this infection can lead to permanent eye damage. You're 60 or older, because age significantly increases your risk of complications. You or someone in your family has a weakened immune system (due to cancer, medications or chronic illness). The rash is widespread and painful. "}, {"illness": "Adult attention-deficit/hyperactivity disorder (ADHD)", "url": "https://www.mayoclinic.org/diseases-conditions/adult-adhd/symptoms-causes/syc-20350878", "symptoms": "Some people with ADHD have fewer symptoms as they age, but some adults continue to have major symptoms that interfere with daily functioning. In adults, the main features of ADHD may include difficulty paying attention, impulsiveness and restlessness. Symptoms can range from mild to severe. Many adults with ADHD aren't aware they have it — they just know that everyday tasks can be a challenge. Adults with ADHD may find it difficult to focus and prioritize, leading to missed deadlines and forgotten meetings or social plans. The inability to control impulses can range from impatience waiting in line or driving in traffic to mood swings and outbursts of anger. Adult ADHD symptoms may include: Impulsiveness Disorganization and problems prioritizing Poor time management skills Problems focusing on a task Trouble multitasking Excessive activity or restlessness Poor planning Low frustration tolerance Frequent mood swings Problems following through and completing tasks Hot temper Trouble coping with stress What's typical behavior and what's ADHD? Almost everyone has some symptoms similar to ADHD at some point in their lives. If your difficulties are recent or occurred only occasionally in the past, you probably don't have ADHD. ADHD is diagnosed only when symptoms are severe enough to cause ongoing problems in more than one area of your life. These persistent and disruptive symptoms can be traced back to early childhood. Diagnosis of ADHD in adults can be difficult because certain ADHD symptoms are similar to those caused by other conditions, such as anxiety or mood disorders. And many adults with ADHD also have at least one other mental health condition, such as depression or anxiety. When to see a doctor If any of the symptoms listed above continually disrupt your life, talk to your doctor about whether you might have ADHD. Different types of health care professionals may diagnose and supervise treatment for ADHD. Seek a provider who has training and experience in caring for adults with ADHD. "}, {"illness": "Anemia", "url": "https://www.mayoclinic.org/diseases-conditions/anemia/symptoms-causes/syc-20351360", "symptoms": "Anemia signs and symptoms vary depending on the cause and severity of anemia. Depending on the causes of your anemia, you might have no symptoms. Signs and symptoms, if they do occur, might include: Fatigue Weakness Pale or yellowish skin Irregular heartbeats Shortness of breath Dizziness or lightheadedness Chest pain Cold hands and feet Headaches At first, anemia can be so mild that you don't notice it. But symptoms worsen as anemia worsens. When to see a doctor Make an appointment with your doctor if you feel fatigued and you don't know why. Fatigue has many causes besides anemia, so don't assume that if you're tired you must be anemic. Some people learn that their hemoglobin is low, which indicates anemia, when they donate blood. If you're told that you can't donate because of low hemoglobin, make an appointment with your doctor. "}, {"illness": "Stroke", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2014/10/29/13/33/r7_ischemicstroke.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/stroke/symptoms-causes/syc-20350113", "symptoms": "If you or someone you're with may be having a stroke, pay particular attention to the time the symptoms began. Some treatment options are most effective when given soon after a stroke begins. Signs and symptoms of stroke include: Trouble speaking and understanding what others are saying. You may experience confusion, slur words or have difficulty understanding speech. Paralysis or numbness of the face, arm or leg. You may develop sudden numbness, weakness or paralysis in the face, arm or leg. This often affects just one side of the body. Try to raise both your arms over your head at the same time. If one arm begins to fall, you may be having a stroke. Also, one side of your mouth may droop when you try to smile. Problems seeing in one or both eyes. You may suddenly have blurred or blackened vision in one or both eyes, or you may see double. Headache. A sudden, severe headache, which may be accompanied by vomiting, dizziness or altered consciousness, may indicate that you're having a stroke. Trouble walking. You may stumble or lose your balance. You may also have sudden dizziness or a loss of coordination. When to see a doctor Seek immediate medical attention if you notice any signs or symptoms of a stroke, even if they seem to come and go or they disappear completely. Think \"FAST\" and do the following: Face. Ask the person to smile. Does one side of the face droop? Arms. Ask the person to raise both arms. Does one arm drift downward? Or is one arm unable to rise? Speech. Ask the person to repeat a simple phrase. Is his or her speech slurred or strange? Time. If you observe any of these signs, call 911 or emergency medical help immediately. Call 911 or your local emergency number right away. Don't wait to see if symptoms stop. Every minute counts. The longer a stroke goes untreated, the greater the potential for brain damage and disability. If you're with someone you suspect is having a stroke, watch the person carefully while waiting for emergency assistance. "}, {"illness": "Dry macular degeneration", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/37/ds00284_-ds01086_im00255_vi7_macular_degenerationthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/dry-macular-degeneration/symptoms-causes/syc-20350375", "symptoms": "Dry macular degeneration symptoms usually develop gradually and without pain. They may include: Visual distortions, such as straight lines seeming bent Reduced central vision in one or both eyes The need for brighter light when reading or doing close-up work Increased difficulty adapting to low light levels, such as when entering a dimly lit restaurant Increased blurriness of printed words Decreased intensity or brightness of colors Difficulty recognizing faces A well-defined blurry spot or blind spot in your field of vision Dry macular degeneration can affect one or both eyes. If only one eye is affected, you may not notice any changes in your vision because your good eye may compensate for the weak eye. And the condition doesn't affect side (peripheral) vision, so it rarely causes total blindness. Dry macular degeneration is one of two types of age-related macular degeneration. It can progress to wet (neovascular) macular degeneration, which is characterized by blood vessels that grow under the retina and leak. The dry type is more common, but it usually progresses slowly (over years). The wet type is more likely to cause a relatively sudden change in vision resulting in serious vision loss. When to see a doctor See your eye doctor if: You notice changes in your central vision Your ability to see colors and fine detail becomes impaired These changes may be the first indication of macular degeneration, particularly if you're over age 60. "}, {"illness": "Acne", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/42/sn7_commonacne-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/acne/symptoms-causes/syc-20368047", "symptoms": "Common acne Common acne Common acne Acne occurs when the openings of hair follicles become clogged and blocked with oil and dead skin cells. If the clogged pore becomes infected with bacteria, it forms a pimple, which is small red bump with pus at its tip. Cystic acne Cystic acne Cystic acne Cystic acne — the most severe form of acne — occurs when oil and dead skin cells build up deep within hair follicles. The resulting rupture within your skin may form boil-like inflammation. Acne signs vary depending on the severity of your condition: Whiteheads (closed plugged pores) Blackheads (open plugged pores) Small red, tender bumps (papules) Pimples (pustules), which are papules with pus at their tips Large, solid, painful lumps under the skin (nodules) Painful, pus-filled lumps under the skin (cystic lesions) Acne usually appears on the face, forehead, chest, upper back and shoulders. When to see a doctor If self-care remedies don't clear your acne, see your primary care doctor. He or she can prescribe stronger medications. If acne persists or is severe, you may want to seek medical treatment from a doctor who specializes in the skin (dermatologist or pediatric dermatologist). For many women, acne can persist for decades, with flares common a week before menstruation. This type of acne tends to clear up without treatment in women who use contraceptives. In older adults, a sudden onset of severe acne may signal an underlying disease requiring medical attention. The Food and Drug Administration (FDA) warns that some popular nonprescription acne lotions, cleansers and other skin products can cause a serious reaction. This type of reaction is quite rare, so don't confuse it with any redness, irritation or itchiness that occurs in areas where you've applied medications or products. Seek emergency medical help if after using a skin product you experience: Faintness Difficulty breathing Swelling of the eyes, face, lips or tongue Tightness of the throat "}, {"illness": "Actinic keratosis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/13/ds00568_im03648_sn7_actinic_keratosisthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/actinic-keratosis/symptoms-causes/syc-20354969", "symptoms": "Actinic keratoses vary in appearance. Signs and symptoms include: Rough, dry or scaly patch of skin, usually less than 1 inch (2.5 centimeters) in diameter Flat to slightly raised patch or bump on the top layer of skin In some cases, a hard, wartlike surface Color variations, including pink, red or brown Itching, burning, bleeding or crusting New patches or bumps on sun-exposed areas of the head, neck, hands and forearms When to see a doctor It can be difficult to distinguish between noncancerous spots and cancerous ones. So it's best to have new skin changes evaluated by a doctor — especially if a scaly spot or patch persists, grows or bleeds. "}, {"illness": "Atopic dermatitis (eczema)", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/42/sn7_atopicdermatitis1.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/atopic-dermatitis-eczema/symptoms-causes/syc-20353273", "symptoms": "Atopic dermatitis on the chest Atopic dermatitis on the chest Atopic dermatitis on the chest Inflammation caused by atopic dermatitis can cover large areas of the body, such as the chest, or be limited to a few small locations. Infantile eczema Infantile eczema Infantile eczema In infants, atopic dermatitis (infantile eczema) usually appears as red, itchy patches that are associated with very dry skin. Atopic dermatitis (eczema) signs and symptoms vary widely from person to person and include: Dry skin Itching, which may be severe, especially at night Red to brownish-gray patches, especially on the hands, feet, ankles, wrists, neck, upper chest, eyelids, inside the bend of the elbows and knees, and in infants, the face and scalp Small, raised bumps, which may leak fluid and crust over when scratched Thickened, cracked, scaly skin Raw, sensitive, swollen skin from scratching Atopic dermatitis most often begins before age 5 and may persist into adolescence and adulthood. For some people, it flares periodically and then clears up for a time, even for several years. When to see a doctor See a doctor if you or your child: Is so uncomfortable that the condition is affecting sleep and daily activities Has a skin infection — look for red streaks, pus, yellow scabs Continues to experience symptoms despite trying home remedies Seek immediate medical attention for your child if the rash looks infected and he or she has a fever. "}, {"illness": "Dandruff", "url": "https://www.mayoclinic.org/diseases-conditions/dandruff/symptoms-causes/syc-20353850", "symptoms": "Dandruff signs and symptoms may include: Skin flakes on your scalp, hair, eyebrows, beard or mustache, and shoulders Itchy scalp Scaly, crusty scalp in infants with cradle cap The signs and symptoms may be more severe if you're stressed, and they tend to flare in cold, dry seasons. When to see a doctor Most people with dandruff don't require a doctor's care. See your primary care doctor or a doctor who specializes in skin conditions (dermatologist) if your condition doesn't improve with regular use of dandruff shampoo. "}, {"illness": "Chronic hives", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/38/ds00313_-ds00980_im01519_r7_hives2thu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/chronic-hives/symptoms-causes/syc-20352719", "symptoms": "Angioedema Angioedema Angioedema Angioedema may cause large welts below the surface of the skin, particularly around the eyes and lips. Signs and symptoms of chronic hives include: Batches of red or skin-colored welts (wheals), which can appear anywhere on the body Welts that vary in size, change shape, and appear and fade repeatedly as the reaction runs its course Itching, which may be severe Painful swelling (angioedema) of the lips, eyelids and inside the throat A tendency for signs and symptoms to flare with triggers such as heat, exercise and stress A tendency for signs and symptoms to persist for more than six weeks and to recur frequently and unpredictably, sometimes for months or years Short-term (acute) hives appear suddenly and clear up within a few weeks. When to see a doctor See your doctor if you have severe hives or hives that continue to appear for several days. Seek emergency medical care Chronic hives don't put you at any sudden risk of a serious allergic reaction (anaphylaxis). If you do experience hives as part of a serious allergic reaction, seek emergency care. Signs and symptoms of anaphylaxis include dizziness, trouble breathing, and swelling of your lips, eyelids and tongue. "}, {"illness": "Poison ivy rash", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/23/ds00774_im01698_ans7_poison_ivythu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/poison-ivy/symptoms-causes/syc-20376485", "symptoms": "Signs and symptoms of a poison ivy rash include: Redness Itching Swelling Blisters Difficulty breathing, if you've inhaled the smoke from burning poison ivy Poison ivy rash often appears in a straight line because of the way the plant brushes against your skin. But if you develop a rash after touching a piece of clothing or pet fur that has urushiol on it, the rash may be more spread out. You can also transfer the oil to other parts of your body with your fingers. The reaction usually develops 12 to 48 hours after exposure and lasts two to three weeks. The severity of the rash depends on the amount of urushiol that gets on your skin. When to see a doctor Seek emergency medical attention if: You inhaled the smoke from burning poison ivy and are having difficulty breathing See your doctor if: The reaction is severe or widespread Your skin continues to swell The rash affects your eyes, mouth or genitals Blisters are oozing pus You develop a fever greater than 100 F (37.8 C) The rash doesn't get better within a few weeks "}, {"illness": "Psoriasis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/38/ds00193_-an02043_im01665_sn7_psoriasisthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/psoriasis/symptoms-causes/syc-20355840", "symptoms": "Plaque psoriasis Plaque psoriasis Plaque psoriasis Plaque psoriasis is the most common type of psoriasis. It usually causes dry, red skin lesions (plaques) covered with silvery scales. Guttate psoriasis Guttate psoriasis Guttate psoriasis Guttate psoriasis, more common in children and adults younger than 30, appears as small, water-drop-shaped lesions on the trunk, arms, legs and scalp. The lesions are typically covered by a fine scale. Scalp psoriasis Scalp psoriasis Scalp psoriasis Psoriasis causes red patches of skin covered with silvery scales and a thick crust on the scalp most often extending just past the hairline that may bleed when removed. Inverse psoriasis Inverse psoriasis Inverse psoriasis Inverse psoriasis causes smooth patches of red, inflamed skin. It's more common in overweight people and is worsened by friction and sweating. Nail psoriasis Nail psoriasis Nail psoriasis Psoriasis can affect fingernails and toenails, causing pitting, abnormal nail growth and discoloration. Pustular psoriasis Pustular psoriasis Pustular psoriasis Pustular psoriasis generally develops quickly, with pus-filled blisters appearing just hours after your skin becomes red and tender. It can occur in widespread patches or in smaller areas on your hands, feet or fingertips. Erythrodermic psoriasis Erythrodermic psoriasis Erythrodermic psoriasis The least common type of psoriasis, erythrodermic psoriasis can cover your entire body with a red, peeling rash that can itch or burn intensely. Psoriasis signs and symptoms can vary from person to person. Common signs and symptoms include: Red patches of skin covered with thick, silvery scales Small scaling spots (commonly seen in children) Dry, cracked skin that may bleed or itch Itching, burning or soreness Thickened, pitted or ridged nails Swollen and stiff joints Psoriasis patches can range from a few spots of dandruff-like scaling to major eruptions that cover large areas. The most commonly affected areas are the lower back, elbows, knees, legs, soles of the feet, scalp, face and palms. Most types of psoriasis go through cycles, flaring for a few weeks or months, then subsiding for a time or even going into remission. There are several types of psoriasis, including: Plaque psoriasis. The most common form, plaque psoriasis causes dry, raised, red skin patches (lesions) covered with silvery scales. The plaques might be itchy or tender, and there may be few or many. They usually appear on elbows, knees, lower back and scalp. Nail psoriasis. Psoriasis can affect fingernails and toenails, causing pitting, abnormal nail growth and discoloration. Psoriatic nails might loosen and separate from the nail bed (onycholysis). Severe cases may cause the nail to crumble. Guttate psoriasis. This type primarily affects young adults and children. It's usually triggered by a bacterial infection such as strep throat. It's marked by small, drop-shaped, scaling lesions on the trunk, arms or legs. Inverse psoriasis. This mainly affects the skin folds of the groin, buttocks and breasts. Inverse psoriasis causes smooth patches of red skin that worsen with friction and sweating. Fungal infections may trigger this type of psoriasis. Pustular psoriasis. This rare form of psoriasis causes clearly defined pus-filled lesions that occur in widespread patches (generalized pustular psoriasis) or in smaller areas on the palms of the hands or the soles of the feet. Erythrodermic psoriasis. The least common type of psoriasis, erythrodermic psoriasis can cover your entire body with a red, peeling rash that can itch or burn intensely. Psoriatic arthritis. Psoriatic arthritis causes swollen, painful joints that are typical of arthritis. Sometimes the joint symptoms are the first or only symptom or sign of psoriasis. And at times only nail changes are seen. Symptoms range from mild to severe, and psoriatic arthritis can affect any joint. It can cause stiffness and progressive joint damage that in the most serious cases may lead to permanent joint damage. When to see a doctor If you suspect that you may have psoriasis, see your doctor. Also, talk to your doctor if your psoriasis: Becomes severe or widespread Causes you discomfort and pain Causes you concern about the appearance of your skin Leads to joint problems, such as pain, swelling or inability to perform daily tasks Doesn't improve with treatment Mayo Clinic Minute: Fingernails are clues to your health (function () {\n\t\t\t\t\t\tkWidget.embed({\"targetId\":\"kaltura-video-1_pqm7f8q1\",\"wid\":\"_1825021\",\"uiconf_id\":44373111,\"flashvars\":{\"IframeCustomPluginCss1\":\"/-/media/kcms/ux/css/kaltura-player.css\",\"localizationCode\":\"auto\",\"autoPlay\":false},\"cache_st\":20200805,\"entry_id\":\"1_pqm7f8q1\",\"readyCallback\": function(playerId) {var kdp = document.getElementById(playerId); kdp.addJsListener('doPlay', 'doPlayCallback'); window.inlineReadyCallbackCalled = playerId; }});\n\t\t\t\t\t})(); Show transcript Viven Williams: Your fingernails are clues to your overall health. Many people develop lines or ridges from the cuticle to the tip. Rachel Miest, M.D.: Those are actually completely fine and just a part of normal aging. Viven Williams: But Dr. Rachel Miest says there are other nail changes you should not ignore that may indicate … Rachel Miest, M.D.: … liver problems, kidney problems, nutritional deficiencies ... Viven Williams: … and other issues. Here are six examples: No. 1 is pitting. This could be a sign of psoriasis. Two is clubbing. Clubbing happens when your oxygen is low and could be a sign of lung issues. Three is spooning. It can happen if you have iron-deficient anemia or liver disease. Four is called \"a Beau's line.\" It's a horizontal line that indicates a previous injury or infection. Five is nail separation. This may happen as a result of injury, infection or a medication. And six is yellowing of the nails, which may be the result of chronic bronchitis. For the Mayo Clinic News Network, I'm Vivien Williams. "}, {"illness": "Rosacea", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/37/an02072_ds00308_im03557_sn7_rosacea_1thu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/rosacea/symptoms-causes/syc-20353815", "symptoms": "Rhinophyma Rhinophyma Rhinophyma Over time, rosacea can thicken the skin on the nose, causing the nose to appear bulbous (rhinophyma). This occurs more often in men than in women. Signs and symptoms of rosacea include: Facial blushing or flushing. Rosacea can cause a persistent blushing or flushing in the central part of your face. This sign of the condition may be difficult to see on brown and Black skin. Visible veins. Small blood vessels of your nose and cheeks break and become visible (spider veins). Swollen bumps. Many people with rosacea also develop pimples on their face that resemble acne. These bumps sometimes contain pus. Burning sensation. The skin of the affected area may feel hot and tender. Eye problems. Many people with rosacea also experience dry, irritated, swollen eyes and eyelids. This is known as ocular rosacea. In some people, the eye symptoms precede the skin symptoms. Enlarged nose. Over time, rosacea can thicken the skin on the nose, causing the nose to appear bulbous (rhinophyma). This occurs more often in men than in women. When to see a doctor If you experience persistent symptoms of your face or eyes, see your doctor or a skin specialist (dermatologist) for a diagnosis and proper treatment. "}, {"illness": "Common warts", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/39/ds00906_-ds00370_im03902_mcdc7_common_wartsthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/common-warts/symptoms-causes/syc-20371125", "symptoms": "Common warts usually occur on your fingers or hands and may be: Small, fleshy, grainy bumps Flesh-colored, white, pink or tan Rough to the touch Sprinkled with black pinpoints, which are small, clotted blood vessels When to see a doctor See your doctor for common warts if: The growths are painful or change in appearance or color You've tried treating the warts, but they persist, spread or recur The growths are bothersome and interfere with activities You aren't sure whether the growths are warts You are an adult and numerous warts begin to appear, which may indicate the immune system is malfunctioning "}, {"illness": "Insomnia", "url": "https://www.mayoclinic.org/diseases-conditions/insomnia/symptoms-causes/syc-20355167", "symptoms": "Insomnia symptoms may include: Difficulty falling asleep at night Waking up during the night Waking up too early Not feeling well-rested after a night's sleep Daytime tiredness or sleepiness Irritability, depression or anxiety Difficulty paying attention, focusing on tasks or remembering Increased errors or accidents Ongoing worries about sleep When to see a doctor If insomnia makes it hard for you to function during the day, see your doctor to identify the cause of your sleep problem and how it can be treated. If your doctor thinks you could have a sleep disorder, you might be referred to a sleep center for special testing. "}, {"illness": "Narcolepsy", "url": "https://www.mayoclinic.org/diseases-conditions/narcolepsy/symptoms-causes/syc-20375497", "symptoms": "The signs and symptoms of narcolepsy may worsen for the first few years and then continue for life. They include: Excessive daytime sleepiness. People with narcolepsy fall asleep without warning, anywhere, anytime. For example, you may be working or talking with friends and suddenly you nod off, sleeping for a few minutes up to a half-hour. When you awaken, you feel refreshed, but eventually you get sleepy again. You may also experience decreased alertness and focus throughout the day. Excessive daytime sleepiness usually is the first symptom to appear and is often the most troublesome, making it difficult for you to concentrate and fully function. Sudden loss of muscle tone. This condition, called cataplexy (KAT-uh-plek-see), can cause a number of physical changes, from slurred speech to complete weakness of most muscles, and may last up to a few minutes. Cataplexy is uncontrollable and is triggered by intense emotions, usually positive ones such as laughter or excitement, but sometimes fear, surprise or anger. For example, when you laugh, your head may droop uncontrollably or your knees may suddenly buckle. Some people with narcolepsy experience only one or two episodes of cataplexy a year, while others have numerous episodes daily. Not everyone with narcolepsy experiences cataplexy. Sleep paralysis. People with narcolepsy often experience a temporary inability to move or speak while falling asleep or upon waking. These episodes are usually brief — lasting a few seconds or minutes — but can be frightening. You may be aware of the condition and have no difficulty recalling it afterward, even if you had no control over what was happening to you. This sleep paralysis mimics the type of temporary paralysis that normally occurs during a period of sleep called rapid eye movement (REM) sleep. This temporary immobility during REM sleep may prevent your body from acting out dream activity. Not everyone with sleep paralysis has narcolepsy, however. Many people without narcolepsy experience some episodes of sleep paralysis. Changes in rapid eye movement (REM) sleep. REM sleep is typically when most dreaming happens. REM sleep can occur at any time of the day in people with narcolepsy. People with narcolepsy often transition quickly to REM sleep, usually within 15 minutes of falling asleep. Hallucinations. These hallucinations are called hypnagogic hallucinations if they happen as you fall asleep and hypnopompic hallucinations if they occur upon waking. An example is feeling as if there is a stranger in your bedroom. These hallucinations may be particularly vivid and frightening because you may not be fully asleep when you begin dreaming and you experience your dreams as reality. Other characteristics People with narcolepsy may have other sleep disorders, such as obstructive sleep apnea — a condition in which breathing starts and stops throughout the night — restless legs syndrome and even insomnia. Some people with narcolepsy experience automatic behavior during brief episodes of narcolepsy. For example, you may fall asleep while performing a task you normally perform, such as writing, typing or driving, and you continue to perform that task while asleep. When you awaken, you can't remember what you did, and you probably didn't do it well. When to see a doctor See your doctor if you experience excessive daytime sleepiness that disrupts your personal or professional life. "}, {"illness": "Sleep apnea", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/40/sl7_sleep_apnea-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/sleep-apnea/symptoms-causes/syc-20377631", "symptoms": "The signs and symptoms of obstructive and central sleep apneas overlap, sometimes making it difficult to determine which type you have. The most common signs and symptoms of obstructive and central sleep apneas include: Loud snoring Episodes in which you stop breathing during sleep — which would be reported by another person Gasping for air during sleep Awakening with a dry mouth Morning headache Difficulty staying asleep (insomnia) Excessive daytime sleepiness (hypersomnia) Difficulty paying attention while awake Irritability When to see a doctor Loud snoring can indicate a potentially serious problem, but not everyone who has sleep apnea snores. Talk to your doctor if you have signs or symptoms of sleep apnea. Ask your doctor about any sleep problem that leaves you fatigued, sleepy and irritable. "}, {"illness": "Hashimoto's disease", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/39/ds00181_-ds00344_-ds00353_-ds00491_-ds00492_-ds00567_-ds00660_-my00709_im01872_thyroid_gif.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/hashimotos-disease/symptoms-causes/syc-20351855", "symptoms": "Hashimoto's disease progresses slowly over the years. You may not notice signs or symptoms of the disease. Eventually, the decline in thyroid hormone production can result in any of the following: Fatigue and sluggishness Increased sensitivity to cold Increased sleepiness Dry skin Constipation Muscle weakness Muscle aches, tenderness and stiffness Joint pain and stiffness Irregular or excessive menstrual bleeding Depression Problems with memory or concentration Swelling of the thyroid (goiter) A puffy face Brittle nails Hair loss Enlargement of the tongue When to see a doctor Signs and symptoms of Hashimoto's disease vary widely and are not specific to the disorder. Because these symptoms could result from any number of disorders, it's important to see your health care provider as soon as possible for a timely and accurate diagnosis. "}, {"illness": "Hyperthyroidism (overactive thyroid)", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/39/ds00181_-ds00344_-ds00353_-ds00491_-ds00492_-ds00567_-ds00660_-my00709_im01872_thyroid_gif.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/hyperthyroidism/symptoms-causes/syc-20373659", "symptoms": "Hyperthyroidism can mimic other health problems, which can make it difficult for your doctor to diagnose. It can also cause a wide variety of signs and symptoms, including: Unintentional weight loss, even when your appetite and food intake stay the same or increase Rapid heartbeat (tachycardia) — commonly more than 100 beats a minute Irregular heartbeat (arrhythmia) Pounding of your heart (palpitations) Increased appetite Nervousness, anxiety and irritability Tremor — usually a fine trembling in your hands and fingers Sweating Changes in menstrual patterns Increased sensitivity to heat Changes in bowel patterns, especially more frequent bowel movements An enlarged thyroid gland (goiter), which may appear as a swelling at the base of your neck Fatigue, muscle weakness Difficulty sleeping Skin thinning Fine, brittle hair Older adults are more likely to have either no signs or symptoms or subtle ones, such as an increased heart rate, heat intolerance and a tendency to become tired during ordinary activities. Graves' ophthalmopathy Sometimes an uncommon problem called Graves' ophthalmopathy may affect your eyes, especially if you smoke. This disorder makes your eyeballs protrude beyond their normal protective orbits when the tissues and muscles behind your eyes swell. Eye problems often improve without treatment. Signs and symptoms of Graves' ophthalmopathy include: Dry eyes Red or swollen eyes Excessive tearing or discomfort in one or both eyes Light sensitivity, blurry or double vision, inflammation, or reduced eye movement Protruding eyeballs When to see a doctor If you experience unexplained weight loss, a rapid heartbeat, unusual sweating, swelling at the base of your neck or other signs and symptoms associated with hyperthyroidism, see your doctor. It's important to completely describe the changes you've observed, because many signs and symptoms of hyperthyroidism may be associated with a number of other conditions. If you've been treated for hyperthyroidism or you currently are being treated, see your doctor regularly as advised so that he or she can monitor your condition. "}, {"illness": "Hypothyroidism (underactive thyroid)", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/39/ds00181_-ds00344_-ds00353_-ds00491_-ds00492_-ds00567_-ds00660_-my00709_im01872_thyroid_gif.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/hypothyroidism/symptoms-causes/syc-20350284", "symptoms": "Thyroid gland Thyroid gland Thyroid gland Your thyroid gland is located at the base of your neck, just below the Adam's apple. The signs and symptoms of hypothyroidism vary, depending on the severity of the hormone deficiency. Problems tend to develop slowly, often over a number of years. At first, you may barely notice the symptoms of hypothyroidism, such as fatigue and weight gain. Or you may simply attribute them to getting older. But as your metabolism continues to slow, you may develop more-obvious problems. Hypothyroidism signs and symptoms may include: Fatigue Increased sensitivity to cold Constipation Dry skin Weight gain Puffy face Hoarseness Muscle weakness Elevated blood cholesterol level Muscle aches, tenderness and stiffness Pain, stiffness or swelling in your joints Heavier than normal or irregular menstrual periods Thinning hair Slowed heart rate Depression Impaired memory Enlarged thyroid gland (goiter) Hypothyroidism in infants Although hypothyroidism most often affects middle-aged and older women, anyone can develop the condition, including infants. Initially, babies born without a thyroid gland or with a gland that doesn't work properly may have few signs and symptoms. When newborns do have problems with hypothyroidism, the problems may include: Yellowing of the skin and whites of the eyes (jaundice). In most cases, this occurs when a baby's liver can't metabolize a substance called bilirubin, which normally forms when the body recycles old or damaged red blood cells. A large, protruding tongue. Difficulty breathing. Hoarse crying. An umbilical hernia. As the disease progresses, infants are likely to have trouble feeding and may fail to grow and develop normally. They may also have: Constipation Poor muscle tone Excessive sleepiness When hypothyroidism in infants isn't treated, even mild cases can lead to severe physical and mental retardation. Hypothyroidism in children and teens In general, children and teens who develop hypothyroidism have the same signs and symptoms as adults do, but they may also experience: Poor growth, resulting in short stature Delayed development of permanent teeth Delayed puberty Poor mental development When to see a doctor See your doctor if you're feeling tired for no reason or have any of the other signs or symptoms of hypothyroidism, such as dry skin, a pale, puffy face, constipation or a hoarse voice. If you're receiving hormone therapy for hypothyroidism, schedule follow-up visits as often as your doctor recommends. Initially, it's important to make sure you're receiving the correct dose of medicine. And over time, the dose you need may change. "}, {"illness": "Thyroid cancer", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/08/26/10/27/ds00492_im03899_c7_thyroidcancerthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/thyroid-cancer/symptoms-causes/syc-20354161", "symptoms": "Thyroid gland Thyroid gland Thyroid gland Your thyroid gland is located at the base of your neck, just below the Adam's apple. Thyroid cancer typically doesn't cause any signs or symptoms early in the disease. As thyroid cancer grows, it may cause: A lump (nodule) that can be felt through the skin on your neck Changes to your voice, including increasing hoarseness Difficulty swallowing Pain in your neck and throat Swollen lymph nodes in your neck When to see a doctor If you experience any signs or symptoms that worry you, make an appointment with your doctor. "}, {"illness": "Blood in urine (hematuria)", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2017/03/11/15/56/r7_urinarytractlabeled-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/blood-in-urine/symptoms-causes/syc-20353432", "symptoms": "Gross hematuria produces pink, red or cola-colored urine due to the presence of red blood cells. It takes little blood to produce red urine, and the bleeding usually isn't painful. Passing blood clots in your urine, however, can be painful. Bloody urine often occurs without other signs or symptoms. When to see a doctor Make an appointment to see your doctor anytime you notice blood in your urine. Some medications, such as the laxative Ex-lax, and certain foods, including beets, rhubarb and berries, can cause your urine to turn red. A change in urine color caused by drugs, food or exercise might go away within a few days. Bloody urine looks different, but you might not be able to tell the difference. It's best to see your doctor anytime you see red-colored urine. "}, {"illness": "Kidney stones", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2017/03/11/15/56/r7_urinarytractlabeled-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/kidney-stones/symptoms-causes/syc-20355755", "symptoms": "Kidney stones Kidney stones Kidney stones Kidney stones form in your kidneys. As stones move into your ureters — the thin tubes that allow urine to pass from your kidneys to your bladder — signs and symptoms can result. Signs and symptoms of kidney stones can include severe pain, nausea, vomiting, fever, chills and blood in your urine. A kidney stone usually will not cause symptoms until it moves around within your kidney or passes into your ureters — the tubes connecting the kidneys and the bladder. If it becomes lodged in the ureters, it may block the flow of urine and cause the kidney to swell and the ureter to spasm, which can be very painful. At that point, you may experience these signs and symptoms: Severe, sharp pain in the side and back, below the ribs Pain that radiates to the lower abdomen and groin Pain that comes in waves and fluctuates in intensity Pain or burning sensation while urinating Other signs and symptoms may include: Pink, red or brown urine Cloudy or foul-smelling urine A persistent need to urinate, urinating more often than usual or urinating in small amounts Nausea and vomiting Fever and chills if an infection is present Pain caused by a kidney stone may change — for instance, shifting to a different location or increasing in intensity — as the stone moves through your urinary tract. When to see a doctor Make an appointment with your doctor if you have any signs and symptoms that worry you. Seek immediate medical attention if you experience: Pain so severe that you can't sit still or find a comfortable position Pain accompanied by nausea and vomiting Pain accompanied by fever and chills Blood in your urine Difficulty passing urine "}, {"illness": "Prostatitis", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2013/11/15/17/36/ds00043_-hq01273_-my00182_im00848_mcdc7_normal_prostate_glandthu_jpg.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/prostatitis/symptoms-causes/syc-20355766", "symptoms": "Signs and symptoms of prostatitis can vary depending on the type of disorder. They may include: Pain or burning sensation when urinating (dysuria) Difficulty urinating, such as dribbling or hesitant urination Frequent urination, particularly at night (nocturia) Urgent need to urinate Cloudy urine Blood in the urine Pain in the abdomen, groin or lower back Pain in the area between the scrotum and rectum (perineum) Pain or discomfort of the penis or testicles Painful ejaculation Fever, chills, muscle aches and other flu-like symptoms (with acute bacterial prostatitis) When to see a doctor Several conditions can contribute to the signs and symptoms associated with prostatitis. It's important to get an accurate diagnosis and treatment as soon as possible. Get immediate care if you have any of the following: Inability to urinate Painful or difficult urination, accompanied by fever Blood in your urine Severe discomfort or pain in the pelvic area or genitals "}, {"illness": "Urinary tract infection (UTI)", "img": "https://www.mayoclinic.org/-/media/kcms/gbs/patient-consumer/images/2017/03/11/15/56/r7_urinarytractlabeled-8col.jpg", "url": "https://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/symptoms-causes/syc-20353447", "symptoms": "Urinary tract infections don't always cause signs and symptoms, but when they do they may include: A strong, persistent urge to urinate A burning sensation when urinating Passing frequent, small amounts of urine Urine that appears cloudy Urine that appears red, bright pink or cola-colored — a sign of blood in the urine Strong-smelling urine Pelvic pain, in women — especially in the center of the pelvis and around the area of the pubic bone UTIs may be overlooked or mistaken for other conditions in older adults. Types of urinary tract infection Each type of UTI may result in more-specific signs and symptoms, depending on which part of your urinary tract is infected. Part of urinary tract affected Signs and symptoms Kidneys (acute pyelonephritis) Back pain or side (flank) pain High fever Shaking and chills Nausea Vomiting Bladder (cystitis) Pelvic pressure Lower abdomen discomfort Frequent, painful urination Blood in urine Urethra (urethritis) Burning with urination Discharge When to see a doctor Contact your doctor if you have signs and symptoms of a UTI. "}, {"illness": "Anorexia nervosa", "url": "https://www.mayoclinic.org/diseases-conditions/anorexia-nervosa/symptoms-causes/syc-20353591", "symptoms": "The physical signs and symptoms of anorexia nervosa are related to starvation. Anorexia also includes emotional and behavioral issues involving an unrealistic perception of body weight and an extremely strong fear of gaining weight or becoming fat. It may be difficult to notice signs and symptoms because what is considered a low body weight is different for each person, and some individuals may not appear extremely thin. Also, people with anorexia often disguise their thinness, eating habits or physical problems. Physical symptoms Physical signs and symptoms of anorexia may include: Extreme weight loss or not making expected developmental weight gains Thin appearance Abnormal blood counts Fatigue Insomnia Dizziness or fainting Bluish discoloration of the fingers Hair that thins, breaks or falls out Soft, downy hair covering the body Absence of menstruation Constipation and abdominal pain Dry or yellowish skin Intolerance of cold Irregular heart rhythms Low blood pressure Dehydration Swelling of arms or legs Eroded teeth and calluses on the knuckles from induced vomiting Some people who have anorexia binge and purge, similar to individuals who have bulimia. But people with anorexia generally struggle with an abnormally low body weight, while individuals with bulimia typically are normal to above normal weight. Emotional and behavioral symptoms Behavioral symptoms of anorexia may include attempts to lose weight by: Severely restricting food intake through dieting or fasting Exercising excessively Bingeing and self-induced vomiting to get rid of food, which may include the use of laxatives, enemas, diet aids or herbal products Emotional and behavioral signs and symptoms may include: Preoccupation with food, which sometimes includes cooking elaborate meals for others but not eating them Frequently skipping meals or refusing to eat Denial of hunger or making excuses for not eating Eating only a few certain \"safe\" foods, usually those low in fat and calories Adopting rigid meal or eating rituals, such as spitting food out after chewing Not wanting to eat in public Lying about how much food has been eaten Fear of gaining weight that may include repeated weighing or measuring the body Frequent checking in the mirror for perceived flaws Complaining about being fat or having parts of the body that are fat Covering up in layers of clothing Flat mood (lack of emotion) Social withdrawal Irritability Insomnia Reduced interest in sex When to see a doctor Unfortunately, many people with anorexia don't want treatment, at least initially. Their desire to remain thin overrides concerns about their health. If you have a loved one you're worried about, urge her or him to talk to a doctor. If you're experiencing any of the problems listed above, or if you think you may have an eating disorder, get help. If you're hiding your anorexia from loved ones, try to find a person you trust to talk to about what's going on. "}, {"illness": "Bulimia nervosa", "url": "https://www.mayoclinic.org/diseases-conditions/bulimia/symptoms-causes/syc-20353615", "symptoms": "Bulimia signs and symptoms may include: Being preoccupied with your body shape and weight Living in fear of gaining weight Repeated episodes of eating abnormally large amounts of food in one sitting Feeling a loss of control during bingeing — like you can't stop eating or can't control what you eat Forcing yourself to vomit or exercising too much to keep from gaining weight after bingeing Using laxatives, diuretics or enemas after eating when they're not needed Fasting, restricting calories or avoiding certain foods between binges Using dietary supplements or herbal products excessively for weight loss The severity of bulimia is determined by the number of times a week that you purge, usually at least once a week for at least three months. When to see a doctor If you have any bulimia symptoms, seek medical help as soon as possible. If left untreated, bulimia can severely impact your health. Talk to your primary care provider or a mental health professional about your bulimia symptoms and feelings. If you're reluctant to seek treatment, confide in someone about what you're going through, whether it's a friend or loved one, a teacher, a faith leader, or someone else you trust. He or she can help you take the first steps to get successful bulimia treatment. Helping a loved one with bulimia symptoms If you think a loved one may have symptoms of bulimia, have an open and honest discussion about your concerns. You can't force someone to seek professional care, but you can offer encouragement and support. You can also help find a qualified doctor or mental health professional, make an appointment, and even offer to go along. Because most people with bulimia are usually normal weight or slightly overweight, it may not be apparent to others that something is wrong. Red flags that family and friends may notice include: Constantly worrying or complaining about being fat Having a distorted, excessively negative body image Repeatedly eating unusually large quantities of food in one sitting, especially foods the person would normally avoid Strict dieting or fasting after binge eating Not wanting to eat in public or in front of others Going to the bathroom right after eating, during meals or for long periods of time Exercising too much Having sores, scars or calluses on the knuckles or hands Having damaged teeth and gums Changing weight Swelling in the hands and feet Facial and cheek swelling from enlarged glands "}, {"illness": "Premenstrual syndrome (PMS)", "url": "https://www.mayoclinic.org/diseases-conditions/premenstrual-syndrome/symptoms-causes/syc-20376780", "symptoms": "The list of potential signs and symptoms for premenstrual syndrome is long, but most women only experience a few of these problems. Emotional and behavioral signs and symptoms Tension or anxiety Depressed mood Crying spells Mood swings and irritability or anger Appetite changes and food cravings Trouble falling asleep (insomnia) Social withdrawal Poor concentration Change in libido Physical signs and symptoms Joint or muscle pain Headache Fatigue Weight gain related to fluid retention Abdominal bloating Breast tenderness Acne flare-ups Constipation or diarrhea Alcohol intolerance For some, the physical pain and emotional stress are severe enough to affect their daily lives. Regardless of symptom severity, the signs and symptoms generally disappear within four days after the start of the menstrual period for most women. But a small number of women with premenstrual syndrome have disabling symptoms every month. This form of PMS is called premenstrual dysphoric disorder (PMDD). PMDD signs and symptoms include depression, mood swings, anger, anxiety, feeling overwhelmed, difficulty concentrating, irritability and tension. When to see a doctor If you haven't been able to manage your premenstrual syndrome with lifestyle changes and the symptoms of PMS are affecting your health and daily activities, see your doctor. "}]